import 'package:flutter/material.dart';
import 'package:nahal_it/Screens/purchese_guide.dart';

class text_style extends StatelessWidget {
  final String title;

  const text_style({super.key, required this.title});

  @override
  Widget build(BuildContext context) {
    var size = MediaQuery.of(context).size;
    return Text(
      title,
      style: TextStyle(
          fontSize: size.width * 0.05,
          fontWeight: FontWeight.bold,
          color: Colors.green.shade800),
    );
  }
}

class BusinessScreen extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    var size = MediaQuery.of(context).size;
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.green,
        centerTitle: true,
        title: Text("خدمات کسب و کار"),
      ),
      body: Directionality(
        textDirection: TextDirection.rtl,
        child: SingleChildScrollView(
          child: Padding(
            padding: EdgeInsets.all(8),
            child: Column(
              children: [
                Image.network(
                    "https://nahalit.com/wp-content/uploads/2022/11/%DA%A9%D8%B3%D8%A8-%D9%88-%DA%A9%D8%A7%D8%B1.jpg"),
                text_style(title: "خدمات در حوزه کسب و کار"),
                Text(
                    "دقت کرده‌اید ما ایرانی‌ ها چقدر برای مدیریت کسب و کار از اصول واقعی دور شده و به سمت تجربیات خودمان یا بقیه می‌رویم؟ مثلا فلان مغازه‌دار با مشتریانش خوش رفتاری نمی‌ کند چون طبق تجربه پدرش این کار باعث پررو شدن مشتری می‌ شود. یا صاحب فلان کارخانه هم رفتار سردی به کارکنانش نشان می‌ دهد چون طبق تجربیات مدیر قبلی، رفتار خوب با نیرو باعث تنبل شدن او خواهد شد و  . . .  . این شاید یکی از مهم‌ ترین دلایل شکست مشاغل در ایران باشد."
                    "هر سازمانی با در نظر گرفتن اهدافی متولد می شود و شروع به رشد می کند. هر چقدر که سازمان در مسیر حرکت خود به اهداف مدیران و مالکان خود نزدیک تر شود، می توانیم بگوییم که از سلامت مناسبی برخوردار است. عوامل و مسائل بسیاری هستند که سلامت یک سازمان را می توانند تهدید کنند و یا به خطر بیندازند."
                    "برخی از این عوامل در داخل خود سازمان هستند و برخی عواملی در محیط و خارج از سازمان. زمانی که عامل یا عواملی سازمان را دچار اختلال می کنند، پیش از آنکه مدیران پی به وجود مشکلات ببرند، می توانند نشانه هایی را در خصوص اختلال به وجود آمده مشاهده نمایند. این امر مستلزم رصد کردن پیوسته سازمان توسط مدیران ارشد سازمان است."
                    "تیم خدمات کسب و کار نهال آی تی ، جهت بهبود سریع تر در کسب و کار های نوپا و انواع کسب و کارها، میتواند از ابتدای هر کسب و کاری، تا برند شدن و افزایش فروش آن کسب و کار ، به شما در زمینه ثبت برند و ثبت لوگو ، ارسال ایمیل و پامک انبوه کمک کند."),
                text_style(title: "خدمات ثبت برند"),
                Text(
                    "اصطلاح برند به مفهومی در تجارت و بازاریابی اشاره دارد که یک شرکت، محصول یا فرد را از سایر همسان ها تمایز می دهد. برندها قابل لمس نیستند و بیشتر به عنوان یک حس و شناخت نسبت به یک شرکت، فرد، یا محصول شناخته می شود."
                    "در واقع می توان گفت هویتی است که شامل ایده ها، ارزش ها، باورها، نگرشها، استاندارد، کیفیت، حسن نیت و اعتماد در کسب و کار و مجموعه ای از این برداشتها و انتظارات در ذهن مصرف کنندگان است که معمولا از طریق تبلیغات مداوم، بازاریابی، روابط عمومی و ارتباطات، همچنین صرف هزینه های بسیار و از طریق واکنش ها و بازخوردهای مصرف کننده و مخاطب موفقیت خود را بدست می آورد و به مرور زمان نیز به تکامل می رسد."
                    "در واقع هر شرکت با تعریف هویت برند خود این پیام را به شرکاء تجاری خود می دهد که ما چگونه سازمانی و با چه اهدافی هستیم. به بیان دیگر شرکت با تعریف این هویت تصویر ذهنی مطلوب خود را برای شکل گیری در ذهن مشتری در آینده ترسیم می نماید."
                    "هویت بخشی به هر برند فرآیندی است که مستلزم تعریف این هویت، عینیت بخشیدن به آن در نمادها و لوگوهای تجاری سازمان (رنگ، فرم و …) و نیز کلیه فعالیت های عملیاتی و تبلیغاتی سازمان برای همسو بودن با آن هویت است."
                    "به طور مثال یک شرکت خدمات پرداخت الکترونیک می خواهد در ذهن مشتریان خود به عنوان شریکی قابل اطمینان نقش بسته و با توجه به اهمیت عامل اطمینان در مبادلات مالی، به انتخاب اول مشتری در فضای رقابتی خود تبدیل گردد."
                    "در واقع قابل اعتماد بودن و پایداری و شرایط مختلف اقتصادی و توان مالی آن به عنوان اجزای تشکیل دهنده هویت شرک نموده و می بایست کلیه فعالیت های شرکت از نحوه برخورد کارکنان مرکز تما مشتریان، نحوه و مدت زمان رفع مغایرتهای مالی ایشان، ادبیات، پوشش و نحوه ارائه خ کارشناسان پشتیبانی، نام و علامت تجاری و… در ارتباطی هدفمند و یکپارچه با برندی را شکل دهند که این تصویر را به صورت پایدار خلق نمایند."),
                text_style(title: "خدمات ثبت لوگو"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/logo-design-service-500x500-transformed-min.png",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "لوگو یک هویت تصویری برای رساندن مفهوم خدمت ، نشان دادن هویت یک سازمان بزرگ و یا کوچک ، به مفهوم رسانی یک وضعیت ، نشانه گذاری یک محصول به وسیله شرکت‌های تجاری، تولیدی و صنعتی و هم‌چنین کسب وکارهای کوچک استفاده می‌ شود تا از این طریق نوع خدمات ، اهداف مورد نظر و محصولات را با بکارگیری از خلاقیت به مخاطب معرفی کنند."
                    "اولین و موثرترین گام برای معرفی یک برند می باشد. که سایر پروسه های هویت سازی یک برند (نظیر بسته بندی، طراحی لیبل و …) را تحت تاثیر خود قرار می دهد. یک آرم و لوگو موفق و صحیح به راحتی می تواند گام های یک مجموعه را به خاطر ثبات بصری خود محکم و هدفمند سازد. اعتماد، شناخت و موفقیت در بازار سه بخش اصلی است که به پشتوانه طراحی برندینگ صحیح ، بجا و مناسب در روند گسترش یک مجموعه کمک بسزا می کند."
                    "اما، هدف اصلی از داشتن لوگو چیست؟ چرا تجارت ما احتیاج به یک لوگو با طراحی حرفه ای داریم؟"
                    "یک پاسخ ساده وجود: یک لوگوی با طراحی حرفه ای توجهات را جلب می کند، و اثری ماندگار روی ذهن مردم دارد. این درست است! برای مثال، به لوگوی نایک، شرکت مشهور کفش های ورزشی نگاه کنید. هنگامی که شما لوگوی تیک را می بینید، به سرعت می فهمید که این متعلق به نایک است. یک مثال معروف دیگر YaHoo! است. مثال های فراوان دیگری نیز میتوان آورد که شما احتمالا هر روز می بینید و بدون شک قدرتی که یک لوگو و شناسه دار و خوب برای شرکت ها را دارد همه تحسین می کنند."),
                text_style(title: "ارسال پیامک انبوه و ارسال ایمیل انبوه"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/%D9%85%D9%82%D8%A7%D9%84%D9%87-%D9%BE%DB%8C%D8%A7%D9%85%DA%A9-%D8%A7%D9%86%D8%A8%D9%88%D9%87-3-min.png",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "یکی از سریع ترین، موثرترین و ارزان ترین روش تبلیغات، ارسال پیامک و ارسال ایمیل تبلیغاتی می باشد با استفاده از امکانات قدرتمندی که پنل اس ام اس و ایمیل در اختیار شما قرار میدهد میتوانید متن تاثیر گذار خود را در کمترین زمان ممکن به مخاطبان خود برسانید و با استفاده از دیگر امکانات پنل پیامک و ایمیل ، محصول و کار خود را تبلیغ نمایید و از این طریق مشتریان خود را افزایش دهید."
                    "استفاده از پنل پیامک و ایمیل یکی از بهترین و آسانترین راه ها برای اطلاع رسانی و ارتباط مستمر با مشتریان می باشد."),
                text_style(title: "خدمات کسب و کار"),
                Divider(),
                Text(
                  "ثبت برند",
                  style: TextStyle(fontSize: 20, fontWeight: FontWeight.bold),
                ),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/brand-registration1-transformed-min.png",
                  width: 150,
                  height: 150,
                ),
                Text(
                    "اصطلاح برند به مفهومی در تجارت و بازاریابی اشاره دارد که یک شرکت، محصول یا فرد را از سایر همسان ها تمایز می دهد. تفاوت را با نهال آی تی تجربه کنید."),
                Divider(),
                Text(
                  "ثبت لوگو",
                  style: TextStyle(fontSize: 20, fontWeight: FontWeight.bold),
                ),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/Business-Logo-Design-Best-Qualitytrahy-lwgw-ksb-w-kar_1609095951-transformed-min.png",
                  width: 200,
                  height: 150,
                ),
                Text(
                    "لوگو یک هویت تصویری برای رساندن مفهوم خدمت ، نشان دادن هویت یک سازمان بزرگ و یا کوچک می باشد. طراحی انواع لوگو های گرافیکی در تیم نهال آی تی"),
                Divider(),
                Text(
                  "ارسال پیامک و ایمیل انبوه",
                  style: TextStyle(fontSize: 20, fontWeight: FontWeight.bold),
                ),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/sms-anboh-transformed-1-min.png",
                  width: 200,
                  height: 150,
                ),
                Text(
                    "یکی از موثرترین روش تبلیغات، ارسال پیامک و ایمیل تبلیغاتی می باشد. استفاده از پنل پیامک و ایمیل یکی از بهترین راه برای اطلاع رسانی و ارتباط با مشتریان می باشد."),
                Text("تعرفه خدمات کسب و کار تیم نهال آی تی",
                    style:
                        TextStyle(fontSize: 20, fontWeight: FontWeight.bold)),
                Divider(),
                Image.network(
                    "https://nahalit.com/wp-content/uploads/2022/11/%D8%AA%D8%B9%D8%B1%D9%81%D9%87-%D8%AE%D8%AF%D9%85%D8%A7%D8%AA-%DA%A9%D8%B3%D8%A8-%D9%88-%DA%A9%D8%A7%D8%B1.png"),
                Container(
                  color: Colors.lightBlueAccent.shade100,
                  child: Column(
                    children: [
                      Image.network(
                          "https://nahalit.com/wp-content/uploads/2022/11/121-min.png"),
                      Text(
                          "جهت سفارش انواع پروژه خدمات کسب و کار ، میتوانید به صورت رایگان ، با شماره 09927674217 تماس بگیرید و یا از طریق لینک زیر اقدام کنید."),
                      TextButton(
                        onPressed: () {
                          Navigator.push(
                              context,
                              MaterialPageRoute(
                                  builder: (context) => Purchase_guide()));
                        },
                        child: Text(
                          "سفارش پروژه طراحی انواع وب سایت",
                          style: TextStyle(color: Colors.white),
                        ),
                        style: ButtonStyle(
                          backgroundColor:
                              MaterialStateProperty.all<Color>(Colors.green),
                        ),
                      ),
                    ],
                  ),
                )
              ],
            ),
          ),
        ),
      ),
    );
  }
}
