import 'package:flutter/material.dart';
import 'package:nahal_it/Screens/purchese_guide.dart';

import '../constants.dart';

class Graphic_Screen extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    var size = MediaQuery.of(context).size;
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.green,
        centerTitle: true,
        title: Text("خدمات گرافیگ"),
      ),
      body: Directionality(
        textDirection: TextDirection.rtl,
        child: SingleChildScrollView(
          child: Padding(
            padding: EdgeInsets.all(8),
            child: Column(
              children: [
                Image.network(
                    "https://nahalit.com/wp-content/uploads/2022/11/%D8%AE%D8%AF%D9%85%D8%A7%D8%AA-%DA%AF%D8%B1%D8%A7%D9%81%DB%8C%DA%A9.jpg"),
                text_style(title: "طراحی بنر"),
                Text(
                    "در تعریف بنر آمده است بنر نواری پارچه‌ای بلندی است که روی آن چیزی نوشته شده است. بنرها معمولاً به دو سر چیزی متصل می‌شوند و در هنگام اعتراض یا تجمع حمل می‌شوند و یا جهت اطلاع رسانی مورد استفاده‌اند. همچنین در تعریف بنر آمده است که تکه پارچه‌ای که حاوی شعاری است یا یک نوار پارچه‌ای بلند که روی آن تبلیغات، تبریک و غیره نوشته شده است. یک بنر تبلیغاتی که بنر وب نیز نامیده می‌شود"),
                text_style(title: "طراحی هویت بصری"),
                Text(
                    "در دنیایی که هر لحظه شاهد تولد کسب و کاری جدید هستیم، اهمیت برندسازی و برندینگ دیگر بر هیچ‌کسی پوشیده نیست. در دنیای پر سرعت ارتباطات و تکنولوژی، هر کسب و کاری باید به روز باشد تا از صحنه رقابت حذف نشود. یکی از مهمترین و تاثیرگذارترین عوامل در برندسازی کسب و کارها، هویت بصری برند یا هویت بصری سازمانی است. پس اگر قصد دارید کسب و کار خودتان را راه اندازی کنید و یا آن را در ذهن مشتریان ماندگار سازید، حتما در ادامه این مطلب همراه ما باشید تا بدانید دقیقا هویت بصری برند چیست و چگونه می توان یک هویت بصری عالی برای کسب و کار خود خلق کرد"),
                text_style(title: "طراحی استند"),
                Text(
                    "بنرهای استند معمولا توسط ۴ عدد فلز و یک گیره در پشت به حالت ایستاده پانچ شده و روی زمین می‌ایستند. سایز این بنرها که به صورت معمول در ایران استفاده می‌شود اکثر ۲ در ۹۰ سانت بصورت ایستاده می‌باشد و بیشتر در مجالس، کنفرانس‌ها، ورودی مراکز، مراکز تبلیغاتی و… مورد استفاده قرار می‌گیرند."),
                text_style(title: "طراحی UI UX"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/1-1.jpg",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "طراحی  گرافیک موضوع آشنا برای تمام کسانی است که به خوبی می دانند دنیای امروز اگر زیباتر از گذشته شده است این را مدیون افرادی است که خلاقیت و هنرهای خود را که بسیار ارزشمند است به دنیای امروز منتقل کرده اند و با استعداد و خلاقیتی که در این زمینه دارند باعث شده اند دنیای امروز ما به زیبایی هرچه تمام تر خود برسد و این زیبایی ها در نقش نقش تمام شاهکارهای هنری این افراد خلاق و مبتکر به خوبی دیده می شود."),
                text_style(title: "طراحی قالب سایت"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/13038-removebg-preview-1.png",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "عمده ترین موشن گرافیک هایی که می بینید و استفاده می شود این دسته می باشد. در این نوع موشن گرافیک ها متحرک سازی تصاویر و وکتور انجام می شود و سپس صداگذاری انجام می گیرد. مطمئنا چون صدا دارد جذابیت بیشتری برای مخاطب دارد و انتقال مفاهیم بهتر انجام می شود."
                    "هرچند اصطلاح موشن گرافیک برای همه گرافیک‌های متحرک شامل تصاویر و ویدئو به کار می‌رود، اما به طور خاص در موشن گرافیک ، به جای تصاویر واقعی، از وکتور یا نقاشی‌هایی استفاده می‌شود که به کمک نرم‌افزارهایی مانند ایلاستریتور تهیه و متحرک سازی می‌شوند. همان‌طور که پیش‌تر اشاره شد این تصاویر متحرک یک سناریو ویژه دارند و پیام کلی آن توسط یک گوینده بر روی تصاویر بیان می‌شود."),
                text_style(title: "2. ویدئو موشن:"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/2.png",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "طراحی  گرافیک موضوع آشنا برای تمام کسانی است که به خوبی می دانند دنیای امروز اگر زیباتر از گذشته شده است این را مدیون افرادی است که خلاقیت و هنرهای خود را که بسیار ارزشمند است به دنیای امروز منتقل کرده اند و با استعداد و خلاقیتی که در این زمینه دارند باعث شده اند دنیای امروز ما به زیبایی هرچه تمام تر خود برسد و این زیبایی ها در نقش نقش تمام شاهکارهای هنری این افراد خلاق و مبتکر به خوبی دیده می شود."),
                text_style(title: "تولید تیزر"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/3-1.jpg",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "تبلیغات یکی از اولیه ترین و اصولی ترین عناصر شناخته شدن در میان مشتریان است در این میان داشتن تیزر تبلیغاتی به خصوص برای محصولات جدید مانند یک سکوی پرتاب است. امروزه با گسترش تکنولوژی، تبلیغات از شکل سنتی خود فاصله گرفته و تبلیغات بصری در رسانه های تصویری محبوبیت گسترده ای پیدا کرده است."),
                text_style(title: "طراحی کاراکتر"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/3-1.png",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "طراحی کاراکتر برای ایجاد شخصیت فیلم‌ها، کتاب های کمیک، اسباب بازی‌ها، تبلیغات و کتاب ها استفاده می‌شود. برای درک بهتر آنچه که طراحان کاراکتر انجام می دهند."),
                text_style(title: "طراحی کاتالوگ"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/what-is-the-catalog-98-04-16-1-600x330-1.jpg",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "کاتالوگ یکی از ابزارهای مهم تبلیغاتی است که صاحبان کسب وکار برای معرفی محصول و برند خود نیاز دارند از آن درکنار سایر ابزارهای بازاریابی و تبلیغاتی استفاده کنند."
                    "اگر بخواهیم کاتالوگ را به صورت حرفه‌ای معرفی نمائیم باید بگوئیم که کاتالوگ شامل دفترچه‌ای از اطلاعات کامل محصولات و یا خدمات است که مخاطب می‌تواند هنگام مطالعه آن با نحوه استفاده از محصولات و یا خدمات آشنا شود."),
                text_style(title: "طراحی لوگو چیست ؟"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/499739efcfb11a821e7ac49ea3680b74.png",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "لوگو یا آرم به علامتی گفته می شود که می تواند تصویر یا یک نوشته و یا ترکیبی از هر دو باشد که به صورتی خاص و منحصر بفرد طراحی شده و به نوعی نشانگر یک کسب و کار، سازمان، فرد و غیره است و باعث می شود تا به آن هویت بخشیده شود. یکی از اولین گام ها برای شروع یک بیزینس یا شرکت یا هر فعالیتی طراحی لوگو برای آن است و عموما صاحبان کسب و کارهای مختلف در همان ابتدای استارت کار ایده های مختلفی برای لوگوی خود دارند. بهتر است پس از اینکه نوع خدمات کسب و کار مورد نظر مشخص شد یا کالای مورد نظر به تولید رسید و آماده برای عرضه ی عمده در بازار بود پیش از هرچیزی لوگو را طراحی کرده تا آماده ی استفاده باشد. چرا که مارکت محصول شما را با نشان تجاری آن یعنی لوگوی آن خواهد شناخت"),
                Row(
                  children: [
                    text_style(title: "طراحی لیبل چیست ؟"),
                    Image.network(
                      "https://nahalit.com/wp-content/uploads/2022/11/5-1.png",
                      width: size.width * 0.5,
                      height: size.width * 0.5,
                    ),
                  ],
                ),
                Text(
                    "لوگو یا آرم به علامتی گفته می شود که می تواند تصویر یا یک نوشته و یا ترکیبی از هر دو باشد که به صورتی خاص و منحصر بفرد طراحی شده و به نوعی نشانگر یک کسب و کار، سازمان، فرد و غیره است و باعث می شود تا به آن هویت بخشیده شود. یکی از اولین گام ها برای شروع یک بیزینس یا شرکت یا هر فعالیتی طراحی لوگو برای آن است و عموما صاحبان کسب و کارهای مختلف در همان ابتدای استارت کار ایده های مختلفی برای لوگوی خود دارند. بهتر است پس از اینکه نوع خدمات کسب و کار مورد نظر مشخص شد یا کالای مورد نظر به تولید رسید و آماده برای عرضه ی عمده در بازار بود پیش از هرچیزی لوگو را طراحی کرده تا آماده ی استفاده باشد. چرا که مارکت محصول شما را با نشان تجاری آن یعنی لوگوی آن خواهد شناخت"),
                text_style(title: "طراحی لوگو چیست ؟"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/499739efcfb11a821e7ac49ea3680b74.png",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "دسته بندی و برچسب گذاری هردو کاربردهای خود را در ارائه مطالب سایت یا وبلاگ دارا هستند. برای حفظ سادگی و دسترسی بهتر کاربران به مطالب سایت پیشنهاد میشود که تعداد دسته ها را بیشتر از پنج عدد قرار ندهید. کاربران برای دسترسی به موضوع مشخصی در سایت شما از دسته ها استفاده میکنند و زیاد بودن تعداد آن میتواند موجب سردردگمی آنها شود، همچنین محدود بودن آن به نویسنده این امکان را میدهد تا موضوع مقاله بعدی خود را براحتی انتخاب کرده و محل نمایش صحیح آن را تعیین کند. برچسب گذاری نیز با هدفی مشابه به کار میرود و ترکیب این دو میتواند راهنمای مناسبی برای کاربران در یافتن مطالب مورد نظرشان در سایت شما باشد. در این مقاله به نحوه صحیح استفاده از برچسب ها یا همان Tag خواهیم پرداخت."),
                text_style(title: "کاتالوگ چیست ؟"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/what-is-the-catalog-98-04-16-3.jpg",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "کاتالوگ یکی از ابزارهای مهم تبلیغاتی است که صاحبان کسب وکار برای معرفی محصول و برند خود نیاز دارند از آن درکنار سایر ابزارهای بازاریابی و تبلیغاتی استفاده کنند."
                    "اگر بخواهیم کاتالوگ را به صورت حرفه‌ای معرفی نمائیم باید بگوئیم که کاتالوگ شامل دفترچه‌ای از اطلاعات کامل محصولات و یا خدمات است که مخاطب می‌تواند هنگام مطالعه آن با نحوه استفاده از محصولات و یا خدمات آشنا شود."),
                text_style(title: "تراکت چیست ؟"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/teraket-rang.png",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "تراکت برگه ای تبلیغاتی است که معمولا به صورت تک برگ و در تیراژ بالا با چاپ افست چاپ می شود ، تراکت ها کاربردی کاملا تبلیغاتی دارند و مناسب تبلیغات داخل شهری هستند، تبلیغات از طریق تراکت یک نوع اعلان و معرفی هردو با هم به حساب می آید. تراکت ها در انواع تحریر ، گلاسه و کرافت، در دو نوع چاپ یکرو و دورو ، رنگی یا سیاه و سفید، پشت چسب دار و یا ساده می باشند."),
                text_style(title: "کارت ویزیت چیست ؟"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/Top_636517983781500000.jpg",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "کارت ویزیت اولین گام در معرفی و بازاریابی در مشاغل مختلف است. در واقع کارت ویزیت واسط معرفی شما و از راه‌های برقراری ارتباط با شماست. امروزه در امر بازاریابی اولین برخورد و بازخورد، نقش بسزایی در جذب مشتری دارد لذا کارت ویزیت از منظر تصویری که در ذهن مشتری از کیفیت کالا و خدمات آن شرکت می‌سازد دارای اهمیت است. خلاقانه بودن کارت ویزیت و کیفیت چاپ آن با ماندگاری آن در ذهن مخاطب رابطه‌ی مستقیمی دارد. چندان‌که اگر کارت ویزیتی با طرحی کلیشه‌ای و کاغذی نامرغوب به دست شما برسد ممکن است این تصور در شما ایجاد شود که صاحب کارت، خدمات یا کالای بی‌کیفیتی به شما ارائه خواهد داد. چنین کارت‌هایی به‌سرعت دور انداخته و فراموش می‌شوند."),
                text_style(title: "بروشور چیست ؟"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/trifold-Brochure-3.jpg",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "اطلاعات: معمولا از بروشور برای اطلاع دادن به مشتریان خود، در مورد شرکت استفاده می شود. این اطلاعات مربوط به محصول یا خدماتی است که شرکت شما ارائه می دهد."
                    "تبلیغات: یک بروشور ابزار تبلیغاتی مهمی است که به طور قابل توجهی به شما اجازه می دهد یک یا چند محصول یا خدمات را تبلیغ کنید."
                    "شناسایی: بروشور باعث می شود که شرکت شما به طور خودکار شناسایی شود و شان و اعتبار کسب و کار را نشان می‌دهد."
                    "آموزشی: بروشور، نحوه استفاده صحیح، بهره برداری و کاربرد یک موضوع خاص را به مخاطبان انتقال می دهد."
                    "بروشور موفق باید نتیجه تعامل این 4 هدف باشد، در غیر این صورت موثر نخواهد بود. شاید یکی از آن ها بیشتر از دیگری برجسته باشد، اما این نباید بر طراحی بروشور تاثیر بگذارد. به عنوان مثال، اگر شرکت شما یک محصول جدید را راه اندازی کرده و تصمیم دارد که یک بروشور طراحی شده به این منظور ایجاد کند، هدفی که در بروشور شما برجسته خواهد بود، تبلیغاتی می باشد."),
                text_style(title: "پوستر و بنرچیست ؟"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/Everything-About-Poster-Design.minimal-abstract-design-posters-covers-templates-vector-20561722_1621174761.jpg",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "در مقاله آشنایی با پوستر و انواع آن  گفتیم که پوستر، یک اعلان گرافیکی شامل متن، تصویر و طرح‌های مختلف است که به منظور انتقال اطلاعات به مخاطبان استفاده می‌شود."
                    "بنر هم با همین تعریف همپای پوستر  توانسته است در صنعت تبلیغات نقش موثری داشته باشد."
                    "پوستر و بنر در ابعاد مختلف چاپ شده و به صورت عمودی بر روی دیوار یا سطوح دیگری نصب می‌شوند"),
                Text(
                  "تفاوت پوستر و بنر",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
                Text("اندازه"
                    """  معمولا طراحان گرافیک برای طراحی بنر از دو اندازه‌ی زیر استفاده می‌کنند:

                    ۷۲۸ *۹۰ که مستطیلی بزرگ و افقی است.

                    ۴۰۰ *۶۰۰ مستطیلی متوسط و عمودی است.

اما اندازه استاندارد و معمول برای پوستر تبلیغاتی به شرح زیر می‌باشد:

                    420*594 mm که برای طراحی در کاغذ های A2 مناسب است

                    297*420 mm که برای طراحی در کاغذ های A3 مناسب است

                    210*297 mm  که برای طراحی در کاغذ های A4 مناسب است

 البته معمولا پوستر‌ها به حالت عمودی و بنر‌ها به حالت افقی چاپ می‌شوند.
"""
                    ""),
                text_style(title: "رابط کاربری گرافیکی چیست؟"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/windows-desktop.jpg",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "رابط کاربری گرافیکی، واسط کاربری گرافیکی، Graphical User Interface یا همان GUI نوعی رابط کاربری است که شامل المان های گرافیکی نظیر آیکن ها، دکمه ها، منو های کرکره ای و … می باشد تا کاربر بتواند به کمک آنها با دستگاه های الکترونیکی تعامل برقرار کند. برای روشن تر شدن این تعریف میتوان به نسخه های مختلف ویندوز اشاره کرد. تمامی نسخه های ویندوز GUI محصوب میشوند. اولین رابط کاربری گرافیکی در سال 1981 توسط آلان کی و داگلاس انجلبارت و با همراهی گروهی از محققان در Xerox PARC توسعه پیدا کرد. پس از آن شرکت اپل با معرفی کامپیوتر لیزا در 19 ژوئن 1983 که اولین کامپیوتر تجاری جهان محسوب میشود از GUI استفاده کرد. تصویر زیر ویندوز 7 دسکتاپ را نشان میدهد."),
                text_style(title: "طراحی قالب سایت چیست ؟"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/images-1.jpg",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    """ قالب وب سایت یا Theme یا Template، به زبان ساده همان ظاهر سایت است که کاربر با آن مواجه می‌شود که حکم همان دکوراسیون را در واقعیت ایفا می‌کند. قالب‌ها ترکیبی از المان‌های مختلف اعم
از رنگ، تصاویر، نوشته‌ها، ستون‌ها و… هستند که وظیفه‌شان انتقال مطالب موجود در وب سایت به شکلی ساده‌ و جذاب‌تر است.

اما چرا یک وب سایت نیازمند یک قالب است؟ مگر نمی‌شود از قالب‌های پیش‌فرض وردپرس استفاده کرد؟
پاسخ قطعا خیر است! چرا که قالب‌های پیش‌فرض بسیار ابتدایی هستند و امکانات زیادی در اختیار شما نمی‌گذارند."""),
                text_style(title: "اینستاگرام چیست ؟"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/Instagram-2-1-removebg-preview.png",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "سرویسی برای اشتراک تصاویر و برقراری تعاملات است. کاربران عکس نظرات یا ویدئوهای کوتاه خودرا بارگزاری میکنند و با دنبال‌کنندگان خود به اشتراک می‌گذارند."),
                text_style(title: "طراحی صفحه ورود"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/10.png",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "هرشخصی برای ورود و ثبت نام در سایت نیاز به صفحه ورود دارد که ما در مجموعه نهال ای تی این بخش رو درفروشگاه خود قراردادیم"),
                text_style(title: "طراحی اسلایدر"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/85.jpg",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    " ما برای هر کسب و کاری نیاز به سایت داریم و هر سایتی برای نمایش به کابر ، زیباتر شدن ، پویا شدن سایت نیاز به اسلایدر متحرک داریم"),
                text_style(title: "بنر متحرک"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/dsf.png",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "بنر متحرک به طور کلی شامل المان های متحرک است که نمای دوچندانی به این دسته از بنرها می بخشد."
                    "اگر با مبحث موشن گرافی این رزوها آشنایی داشته باشید می توانید به این مهم دست بیابید که بنرهای متحرک همان موشن گرافی است که فاقد هرگونه صدایی هستند.این دسته از بنرها عموما مطالب بیشتر را به دنبال متحرک بودن می توانند ساپورت کنند.ما مدعی پایین ترین هزینه طراحی بنر در کنار بهترین کیفیت و هارمونی هستیم."),
                Image.network(
                    "https://nahalit.com/wp-content/uploads/2022/11/%D8%AA%D8%B9%D8%B1%D9%81%D9%87-%D8%B7%D8%B1%D8%A7%D8%AD%DB%8C-%DA%AF%D8%B1%D8%A7%D9%81%DB%8C%DA%A92-min.png"),
                Container(
                  color: Colors.lightBlueAccent.shade100,
                  child: Column(
                    children: [
                      Image.network(
                          "https://nahalit.com/wp-content/uploads/2022/11/frm-thbt-sfarsh-transformed-min.png"),
                      Text(
                          "جهت سفارش انواع پروژه گرافیک ، میتوانید به صورت رایگان ، با شماره 09927674217 تماس بگیرید و یا از طریق لینک زیر اقدام کنید."),
                      TextButton(
                        onPressed: () {
                          Navigator.push(
                              context,
                              MaterialPageRoute(
                                  builder: (context) => Purchase_guide()));
                        },
                        child: Text(
                          "سفارش پروژه گرافیک",
                          style: TextStyle(color: Colors.white),
                        ),
                        style: ButtonStyle(
                          backgroundColor:
                              MaterialStateProperty.all<Color>(Colors.green),
                        ),
                      ),
                    ],
                  ),
                )
              ],
            ),
          ),
        ),
      ),
    );
  }
}
