import 'package:flutter/material.dart';
import 'package:nahal_it/Screens/purchese_guide.dart';

import '../constants.dart';

class ApplicationScreen extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    var size = MediaQuery.of(context).size;
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.green,
        centerTitle: true,
        title: Text("خدمات اپلبکیشن موبایل"),
      ),
      body: Directionality(
        textDirection: TextDirection.rtl,
        child: SingleChildScrollView(
          child: Padding(
            padding: EdgeInsets.all(8),
            child: Column(
              children: [
                Image.network(
                    "https://nahalit.com/wp-content/uploads/2022/11/%D8%AE%D8%AF%D9%85%D8%A7%D8%AA-%D8%A7%D9%BE%D9%84%DB%8C%DA%A9%DB%8C%D8%B4%D9%86-%D9%85%D9%88%D8%A8%D8%A7%DB%8C%D9%84.jpg"),
                text_style(title: "اپلیکیشن یا نرم‌افزار چیست؟؟"),
                image_style(
                    imageUrl:
                        "https://nahalit.com/wp-content/uploads/2022/11/5-min.png"),
                Text(
                    "بسیاری از برنامه‌های موجود بر روی گوشی هوشمند، که استفاده از آنها فرد را قادر به برقراری ارتباط با دیگران یا انجام فعالیت‌های روزمره می‌کند، اپلیکیشن یا نرم‌افزار نامیده می‌شود."
                    "به عبارت ساده، تمام برنامه‌هایی که بر روی گوشی هوشمند خود دارید نرم‌افزار به‌حساب می‌آیند؛ اما اگر بخواهیم تعریفی دقیق از نرم‌افزار ارائه دهیم باید بگوییم، تمام برنامه‌های موجود در گوشی‌های هوشمند به‌جز زبان‌های برنامه‌نویسی و سیستم‌عامل گوشی در دسته اپلیکیشن­های موبایل قرار می‌گیرند."
                    "وب‌سایت Techopedia مرجع رسمی اصطلاحات دنیای تکنولوژی است."
                    "در این وب‌سایت در تعریف اپلیکیشن آمده است: اپلیکیشن موبایل بانام مخفف app نوعی نرم‌افزار رایانه‌ای به شمار می‌آید که از آن برای ارتباط نهایی کاربران استفاده شده و قابلیت اجرا بر روی سیستم‌عامل گوشی‌های هوشمند را دارد."
                    "این نرم‌افزارها از قابلیت اجرای اغلب خدمات کامپیوتر مانند پخش ویدئو برخوردار هستند."
                    "App ها معمولا دارای حجم کم و عملکرد محدود هستند."),
                text_style(title: "اهمیت ساخت اپلیکیشن موبایل"),
                Text(
                    "امروزه هر کسب و کاری قصد دارد مخاطبان، محبوبیت برند، فروش و درآمدزایی خود را افزایش دهد. یک برنامه تلفن همراه توانایی انجام همه این کارها را دارد و به مشاغل کمک می کند فرصت های رشد چندگانه را پیدا کنند و درآمد خود را افزایش دهند."
                    "امروزه تعداد کاربران گوشی های هوشمند با جهشی فوق العاده در حال افزایش است و اعتقاد بر این است که تقریباً 80٪ از مردم دنیا از تلفن های همراه استفاده می کنند. مردم از دستگاه های تلفن همراه برای تأمین نیازهای روزمره خود مانند رزرو تاکسی، خرید آنلاین، خرید بلیط و … استفاده می کنند."
                    "بنابراین در عصر حاضر طراحی اپلیکیشن موبایل برای هر کسب و کاری ضروری است، چه یک شرکت تازه تاسیس باشد چه یک شرکت باسابقه. اگر هنوز قصد ندارید یک برنامه تلفن همراه برای تجارت خود بسازید پس از رقبای خود بسیار عقب هستید. برای غلبه بر رقابت و پیشی گرفتن از رقبای خود اکنون باید برنامه ریزی کنید. تمام کاری که شما باید انجام دهید این است که یک ایده ابتکاری برای ساخت اپلیکیشن موبایل خود بدست آورید و با یک توسعه دهنده اپلیکیشن تماس بگیرید."),
                text_style(title: "خدمات اپلیکیشن موبایل"),
                Text(
                    "این روزها کمتر کسی را می توان پیدا کرد که از گوشی هوشمند استفاده نکند. تقریبا می شود گفت گوشی های هوشمند به بخش غیر قابل انکار زندگی هر کدام از ما تبدیل شده است. چنانچه هر کدام از ما مشکلی یا سوال داشته باشیم سریعا به گوشی های هوشمند خود سر می زنیم .برای برقراری ارتباط، جهت بازی، برای خرید اینترنتی برای هر کاری که بشود آن را از طریق اینترنت انجام داد. کلمه “اپ” مخفف کلمه “اپلیکیشن” است که می تواند از طریق مرورگر وب یا آفلاین در رایانه شما و در تلفن هوشمند، تبلت یا سایر دستگاه های الکترونیکی از جمله تلویزیون های هوشمند و باید به فکر ساعت های هوشمند اجرا شود. پس اگر شما به دنبال رونق کسب و کار خود هستید، حتماً ایجاد بخشی اینترنتی برای آن نیز باشید. در میان بخش های مجازی مربوط به کسب و کار ها، از آن جا که گوشی های تلفن همراه گسترش بیشتری نسبت به کامپیوتر ها در میان اقشار جامعه داشته اند و تقریباً مردم از هر سنی یک گوشی هوشمند همراه خود دارند، ساخت و طراحی اپلیکیشن کسب و کارتان در بستر گوشی های تلفن همراه از تمام بخش های دیگر دارای اهمیت بیشتری است."),
                text_style(title: "مزایای طراحی اپلیکیشن اختصاصی"),
                image_style(
                    imageUrl:
                        "https://nahalit.com/wp-content/uploads/2022/11/6-min.png"),
                Text("""افزایش بهره وری کسب و کار شما

افزایش محبوبیت برند شما

برقرای ارتباط نزدیک با مشتریان

افزایش انگیزه تعامل برای کاربران

کاهش هزینه و افزایش درآمد

افزایش ترویج وفاداری مشتری

پیشی گرفتن از سایر رقبا

افزایش حفظ و نگهداری مشتریان

با داشتن یک اپلیکیشن اختصاصی برای کسب و کار خود باعث رشد و پیشرفت هر چه بیشتر کسب و کارتان شوید.
"""),
                text_style(title: "اپلیکیشن موبایل چیست؟"),
                image_style(
                    imageUrl:
                        "https://nahalit.com/wp-content/uploads/2022/11/3-min.png"),
                Text(
                    "اپلیکیشن‌ موبایل عبارت‌است از از نرم افزارهایی که ارتباط مستقیم با پردازنده‎های سیستم عامل گوشی همراه دارند و مستقیماً درخواست‎های کاربران را انجام می‌دهند. اپلیکیشن ها در موبایل به صورت مستقیم دستوری را انجام می‌دهند که کاملاً برای کاربران ملموس و قابل رؤیت است. اگر بخواهیم در مورد اپلیکیشن موبایل مثالی را بزنیم باید بگوئیم به کلیه نرم افزارهای گوشی که کاربر توسط آنها به اجرای فرمانی در گوشی می پردازد اپلیکیشن نام دارد. برای مثال شما ممکن است برای فعالیت های مالی بسته به حساب بانکی خود ممکن است از اپلیکیشن موبایل بانک ملت، اپلیکیشن موبایل بانک پاسارگاد، اپلیکیشن موبایل بانک ملی، اپلیکیشن موبایل بانک سامان، اپلیکیشن موبایل بانک اقتصاد نوین، اپلیکیشن موبایل بانک سپه، اپلیکیشن موبایل بانک آینده و یا غیره استفاده نمائید. و یا ممکن است شما در طول روز به استفاده از ابزارهای دیگری در گوشی همراه خود بپردازید. برای مثال ممکن است برای دنبال کردن رویدادهای ورزشی از اپلیکیشن موبایل شبکه سه استفاده کنید"
                    "برای دنبال کردن برنامه های تلویزیونی ممکن است از اپلیکیشن اندروید پخش زنده استفاده نمائید. همچنین برخی کاربران که از طریق فروشگاه اینترنتی به خرید میپردازند ممکن است از اپلیکیشن سایت های مانند اپلیکیشن موبایل دیجی کالا و یا اپلیکیشن موبایل بامیلو استفاده نمایند. همچنین برای مثال ممکن است اپلیکیشن بازی خاصی هم برای PC ارائه شود و هم به صورت اپلیکیشن موبایل ارائه گردد که در این صورت توسعه دهنده نرم افزار سعی میکند این بازی را بر پایه دستگاه های دیجیتال تولید نماید. برای مثال اپلیکیشن م وبایل clash of clans از مواردی است که برای انجام بازی برنامه نویسی شده است. یا بازی angry birds یکی دیگر از موارد اپلیکیشن موبایل می باشد. تمامی این ابزارها که در دسترس شما قرار گرفته اند اپلیکیشن موبایل نام دارند که ممکن است براساس نوع سیستم عامل یک گوشی همراه، برای اجرا نیازمند بستر و سیستم عامل مورد نیاز خود باشند مربوط به خود باشند. یک اپلیکیشن موبایل ممکن است بر پایه سیستم عامل اندروید باشد که به در این حالت به این نرم افزار اصطلاحاً اپلیکیشن اندروید می گویند. یا ممکن است سیستم عالی که این نرم افزار را مدیریت میکند برپایه IOS باشد که در این حالت به آن اپلیکیشن IOS یا اپلیکیشن اپل می گویند. برای دیگر سیستم عامل ها همانند ویندوز فون، بلک بری، جاوا، سیمبین و غیره نیز اپلیکیشن هایی بسته به نوع بستر سیستم عامل طراحی شده است. توسعه دهندگان اپلیکیشن موبایل، همانطور که سعی کرده اند براساس دستگاه های مختلف ورژن های متفاوتی از نرم افزار را ارائه دهند، برای سیستم عامل های مختلفی که ممکن است بر روی موبایل به کار رود نیز سعی میکنند به ساخت و طراحی ورژن های مختلفی از یک اپلیکیشن موبایل بپردازند."),
                text_style(title: "اپلیکیشن اندروید"),
                image_style(
                    imageUrl:
                        "https://nahalit.com/wp-content/uploads/2022/11/1.png"),
                Text(
                    "Android به زبان ساده سیستم عاملی است برای دستگاه های موبایل و گوشی های هوشمند که توسط بیش از 30 کمپانی معروف پشتیبانی می شود. اندروید اوپن سورس است و توسعه دهندگان می توانند با استفاده از Android SDK انواع اپلیکیشن اندروید را برای این سیستم عامل بنویسند. در واقع اندروید بستری را فراهم می کند تا برنامه نویسان اپلیکیشن اندروید بتوانند هرچه سریعتر و بهتر برنامه هایی بسازند که از تمام ویژگی های یک گوشی هوشمند استفاده کند. اندروید به معنای واقعی “ باز” (Open) است، یعنی برنامه نویس می تواند از تمام قدرت یک تلفن همراه استفاده کند. اندروید امکان استفاده از توابع داخلی گوشی موبایل همچون شماره گیری، فرستادن SMS یا استفاده از دوربین گوشی را به برنامه نویسان می دهد تا بتوانند اپلیکیشن اندروید قدرتمند و کاربردی برای کاربران بسازند."),
                text_style(title: "اپلیکیشن جاوا"),
                image_style(
                    imageUrl:
                        "https://nahalit.com/wp-content/uploads/2022/11/2-min-768x768.png"),
                Text(
                    "Java یکی از زبان های برنامه نویسی سطح بالا می باشد که مبتنی بر کلاس و شی گرا است و به صورت رایگان در اختیار برنامه نویسان قرار می گیرد و با آن می توان برنامه های مختلفی ساخت. زبان برنامه نویسی Java بیشتر در ساخت نرم افزار اندروید مورد استفاده قرار می گیرد و کاربرد دارد."
                    "جاوا پر کاربــرد ترین پلت فرم براي گوشي هاي بدون سیستم عامل است ما میتوانیم یک اپلیکیشن فوق العاده با استفاده از جاوا برای شما بسازیم."),
                text_style(title: "اپلیکیشن ios"),
                image_style(
                    imageUrl:
                        "https://nahalit.com/wp-content/uploads/2022/11/4-min-600x600.png"),
                Text(
                    "شرکت نهال آی تی علاوه بر طراحی اپلیکیشن های اندرویدی به ساخت وطراحی اپلیکیشن ios نیز می پردازد و طبق خواسته مشتری هریک از این اپ ها را به صورت اختصاصی و حرفه تولید و طراحی کرده و در اختیار شما عزیزان قرار خواهد داد، البته لازم به ذکر است که نهال آی تی با استفاده از فریم ورک های حرفه ای برنامه نویسی اپلیکیشن ها را به گونه ای طراحی می کند که هم در پلتفرم اندروید و هم در ios سازگار باشد، برای اطلاعات بیشتر در زمینه طراحی اپلیکیشن موبایل با مشاورین نهال آی تی در تماس باشید."),
                text_style(title: "خدمات طراحی اپلیکیشن موبایل"),
                Text(
                  "طراحی اپلیکیشن اندروید",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
                image_style(
                    imageUrl:
                        "https://nahalit.com/wp-content/uploads/2022/11/226770.png"),
                Text(
                    "از مزایای داشتن اپلیکیشن اندروید، می توان به موارد زیر اشاره کرد: فروش شما را افزایش می‌دهد و مخاطبانتان را زیاد میکند و همچنین میتوانید همیشه در دسترس مشتریانتان باشید."),
                Text(
                  "طراحی اپلیکیشن IOS",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
                image_style(
                    imageUrl:
                        "https://nahalit.com/wp-content/uploads/2022/11/168-1689299_apple-green-apple-logo-transparent-transformed.png"),
                Text(
                    "از مزایای داشتن اپلیکیشن IOS، می توان به موارد زیر اشاره کرد: فروش شما را افزایش می‌دهد و مخاطبانتان را زیاد میکند و همچنین میتوانید همیشه در دسترس مشتریانتان باشید."),
                Text(
                  "طراحی اپلیکیشن جاوا",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
                image_style(
                    imageUrl:
                        "https://nahalit.com/wp-content/uploads/2022/11/58480979cef1014c0b5e4901.png"),
                Text(
                    "جاوا پر کاربــرد ترین پلت فرم براي گوشي هاي بدون سیستم عامل است ما در تیم نهال آی تی میتوانیم یک اپلیکیشن فوق العاده با استفاده از جاوا برای شما بسازیم."),
                Image.network(
                    "https://nahalit.com/wp-content/uploads/2022/11/%D8%AA%D8%B9%D8%B1%D9%81%D9%87-%D8%A7%D9%BE%D9%84%DB%8C%DA%A9%DB%8C%D8%B4%D9%86-%D9%85%D9%88%D8%A8%D8%A7%DB%8C%D9%84-%D8%A7%D9%82%D8%AA%D8%B5%D8%A7%D8%AF%DB%8C-min.png"),
                Image.network(
                    "https://nahalit.com/wp-content/uploads/2022/11/%D8%AA%D8%B9%D8%B1%D9%81%D9%87-%D8%A7%D9%BE%D9%84%DB%8C%DA%A9%DB%8C%D8%B4%D9%86-%D9%85%D9%88%D8%A8%D8%A7%DB%8C%D9%84-%D8%AD%D8%B1%D9%81%D9%87-%D8%A7%DB%8C-min.png"),
                Image.network(
                    "https://nahalit.com/wp-content/uploads/2022/11/%D8%AA%D8%B9%D8%B1%D9%81%D9%87-%D8%A7%D9%BE%D9%84%DB%8C%DA%A9%DB%8C%D8%B4%D9%86-%D9%85%D9%88%D8%A8%D8%A7%DB%8C%D9%84-%D9%88%DB%8C%DA%98%D9%87-min.png"),
                Container(
                  color: Colors.lightBlueAccent.shade100,
                  child: Column(
                    children: [
                      Image.network(
                          "https://nahalit.com/wp-content/uploads/2022/11/frm-thbt-sfarsh-transformed-min.png"),
                      Text(
                          "جهت سفارش انواع خدمات اپلیکیشن موبایل ، میتوانید به صورت رایگان ، با شماره 09927674217 تماس بگیرید و یا از طریق لینک زیر اقدام کنید."),
                      TextButton(
                        onPressed: () {
                          Navigator.push(
                              context,
                              MaterialPageRoute(
                                  builder: (context) => Purchase_guide()));
                        },
                        child: Text(
                          "سفارش پروژه اپلیکیشن موبایل",
                          style: TextStyle(color: Colors.white),
                        ),
                        style: ButtonStyle(
                          backgroundColor:
                              MaterialStateProperty.all<Color>(Colors.green),
                        ),
                      ),
                    ],
                  ),
                )
              ],
            ),
          ),
        ),
      ),
    );
  }
}
