import 'package:flutter/material.dart';

import '../gradient.dart';

class RobotsScreen extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    var size = MediaQuery.of(context).size;
    return Scaffold(
      appBar: AppBar(
        centerTitle: true,
        title: Text(
          "ربات شبکه های اجتماعی",
          style: TextStyle(fontWeight: FontWeight.bold),
        ),
        backgroundColor: Colors.green,
      ),
      body: Stack(
        children: [
          MyGradient(),
          SingleChildScrollView(
            child: Directionality(
              textDirection: TextDirection.rtl,
              child: Padding(
                padding: const EdgeInsets.all(8.0),
                child: Container(
                  child: Column(
                    children: <Widget>[
                      _buildSectionTitle("ربات تلگرام:"),
                      _buildParagraph(
                          "ربات های تلگرام در واقع حساب های کاربری تلگرام هستند که از طریق نرم افزار و به صورت خودکار عمل می کنند. هر ربات یک کاربر تلگرام است که برای اهداف خاصی طراحی می شود و عمل می کند. این ربات ها دارای سطحی از هوش مصنوعی هستند و به کمک آن عملیات خود را انجام می دهند. آنها قادر به انجام هر کاری از جمله آموزش، پخش موسیقی، جستجو، برقراری ارتباط و حتی ارسال دستور به IoT یا اینترنت اشیا، ساخت بازی های یک یا چند نفره، ایجاد سرویس های اجتماعی، ایجاد ابزارهای جانبی و برقراری ارتباط با سرویس های دیگر هستند."
                          "اگر به صورت تخصصی به آن ها نگاه کنیم، ربات ها کاربران ویژه تلگرام هستند که از طریق پلتفرمی با نام bot API و از مسیر درخواست های ارسالی از پروتکل HTTPS پیام ها را پردازش می کنند."),
                      _buildSectionTitle("ربات واتساپ:"),
                      _buildParagraph(
                          "در سال‌های اخیر استفاده از ایمیل مارکتینگ در صدر روش‌های بازاریابی به‌جهت جذب مشتری قرار داشته است که با روی کار آمدن شیوه‌های نوین عملاً غیر قابل استفاده شده یا حداقل به کمترین میزان، تنزل پیدا کرده است."
                          "در حال حاضر استفاده از ربات‌ها که نمونه ایده‌آل آن با عنوان ربات واتساپ در اختیار متقاضیان قرار داده می‌شود از بهترین روش‌های تبلیغات در واتساپ به‌شمار می‌رود که نتایج شگفت انگیزی به‌همراه داشته است."),
                      _buildSectionTitle("خدمات لینکدین:"),
                      _buildParagraph(
                          "لینکدین یا لینکداین (LinkedIn) یک شبکه اجتماعی است. شاید خیلی‌ها با خواندن این جمله گمان کنند که لینکدین هم چیزی شبیه فیس‎بوک و اینستاگرام است، که البته چنین نیست."
                          "لینکدین به نوعی در ایران مهجور و غریب است و بسیاری از ایرانی‌ها – حتی افراد تحصیل کرده و یا دانشجو – نمی‌دانند لینکدین چیست و به چه کار می‌آید."
                          "بنابراین برای پاسخ به این سوال که «لینکدین چه جور جایی است؟» بیایید با هم نگاهی به چند تا از القاب این شبکه اجتماعی داشته باشیم، که اغلب آنها تا حدودی شبیه هم هستند:"
                          "\n• شبکه مهندسان، مدیران و افراد حرفه‌ای\n"
                          "• محلی ایده‌آل برای تبادل نظر پیرامون مسائل تجاری"
                          "\n• شبکه‌ای برای بهبود کسب و کارها"
                          "\n• شبکه‌ای ویژه کارآفرینان، کارمندان، مدیران، کارشناسان و صاحبان مشاغل و صنایع"
                          "\n• مکانی ایده‌آل برای نشان دادن تاریخچه فعالیت‌ها و رزومه کاری شما یا شرکت‌تان\n"
                          "• فضایی مناسب برای ارتباط‌گیری افراد همکار و کسانی که در یک رشته و صنعت مشغول به کار هستند\n"
                          "در این شبکه ارزشمند، حرفه‌ای و قدرتمند، هر کس از هر صنف و صنعتی می‌تواند با کمی جستجو، افراد مشابه خود را پیدا کرده و با آنها ارتباط برقرار نماید و با به اشتراک گذاشتن دانش خود و استفاده از تجربیات دیگران، این فضای حرفه‌ای را به خوبی به خدمت بگیرد."),
                    ],
                  ),
                ),
              ),
            ),
          )
        ],
      ),
    );
  }

  Widget _buildSectionTitle(String title) {
    return Padding(
      padding: EdgeInsets.only(top: 16.0, bottom: 8.0),
      child: Text(
        title,
        style: TextStyle(
          fontWeight: FontWeight.bold,
          fontSize: 20.0,
        ),
      ),
    );
  }

  Widget _buildParagraph(String text) {
    return Padding(
      padding: EdgeInsets.only(bottom: 8.0),
      child: Text(
        text,
        style: TextStyle(
          fontSize: 16.0,
        ),
        textAlign: TextAlign.justify,
      ),
    );
  }
}
