import 'package:flutter/material.dart';
import 'package:nahal_it/Screens/purchese_guide.dart';

class text_style extends StatelessWidget {
  final String title;

  const text_style({super.key, required this.title});

  @override
  Widget build(BuildContext context) {
    var size = MediaQuery.of(context).size;
    return Text(
      title,
      style: TextStyle(
          fontSize: size.width * 0.05,
          fontWeight: FontWeight.bold,
          color: Colors.green.shade800),
    );
  }
}

class Website_sales extends StatelessWidget {
  const Website_sales({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    var size = MediaQuery.of(context).size;
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.green,
        centerTitle: true,
        title: Text("فروش سایت اختصاصی و اقتصادی"),
      ),
      body: Directionality(
        textDirection: TextDirection.rtl,
        child: SingleChildScrollView(
          child: Padding(
            padding: EdgeInsets.all(8),
            child: Column(
              children: [
                Image.network(
                    "https://nahalit.com/wp-content/uploads/2022/11/%D9%81%D8%B1%D9%88%D8%B4-%D8%B3%D8%A7%DB%8C%D8%AA-%D8%A7%D8%AE%D8%AA%D8%B5%D8%A7%D8%B5%DB%8C%DB%B1.jpg"),
                text_style(title: "فروش سایت اختصاصی و اقتصادی"),
                Text(
                    "در این بخش از خدمات، سایت های آماده فروشگاهی و سازمانی و شرکتی و مدیریتی و اداری و خبری و اختصاصی، آماده به فروش می باشد که با زبان ها و فریم ورک های مختلف مانند جنگو و لاراول و وردپرس و php ارائه می شود."),
                Text(
                  "فروش انواع سایت های اختصاصی و اقتصادی",
                  style: TextStyle(
                      fontSize: size.width * 0.05,
                      fontWeight: FontWeight.bold,
                      color: Colors.grey.shade800),
                ),
                Text(
                    "فعالیت تیم نهال آی تی در حوزه دیجیتال مارکتینگ مجری پروژه طراحی سایت شرکتی و ساخت سایت فروشگاهی برندهای معتبر داخلی و بین المللی می باشد و هر نمونه طراحی سایت و فروش قالب سایت، متناسب با نیاز و ماهیت هر برند به شکلی منحصر به فرد طراحی و پیاده سازی می‌شود."
                    "داشتن یک وب ‌سایت برای کسب و کار خود، یکی از مهمترین فاکتورهای بازاریابی آنلاین به حساب می‌آید."
                    "امروزه عمر کسب‌و‌کارهایی که فاقد وب‌سایت هستند رو به پایان است، از این رو برای هدف‌گیری مشتریان راهی جز طراحی سایت اختصاصی و یا خرید قالب های متناسب با کسب و کار خود با رابط کاربری مناسب، ندارید و این دقیقا کاری است که تیم نهال آی تی برای شما به بهترین نحو ممکن انجام خواهد داد."
                    "در این بخش از خدمات، فروشگاه های اینترنتی، سایت های آماده سازمانی و شرکتی و مدیریتی و اداری و دولتی و خبری و اختصاصی، آماده به فروش می باشد که با زبان ها و فریم ورک های مختلف برنامه نویسی مانند جنگو و لاراول و وردپرس و php ارائه می شود که در ادامه به توضیح هر یک از این ها خواهیم پرداخت."),
                text_style(title: "فریمورک جنگو چیست ؟"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/python-django-min.png",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "جنگو یک فریمورک وب مبتنی بر زبان برنامه نویسی پایتون و زبان سطح بالا می باشد که امکان طراحی سایت فروشگاهی و توسعه سریع وب سایت‌ های ایمن را فراهم می‌کند."
                    "جنگو توسط توسعه دهندگان باتجربه ساخته شده و از بسیاری از مشکلات هنگام تولید وب سایت پیشگیری می‌کند. این برنامه رایگان و منبع باز (Open Source) است، همچنین دارای یک انجمن پرکاربرد و فعال، مستندات عالی و گزینه‌های زیادی برای پشتیبانی رایگان و غیر رایگان می‌ باشد."),
                Text(
                  "مزایای قابل توجه فریمورک جنگو",
                  style: TextStyle(
                      fontSize: size.width * 0.05,
                      fontWeight: FontWeight.bold,
                      color: Colors.green.shade800),
                ),
                Text(
                    "– اگر شما مجبور شوید در تیم کد نویسی خود تغییراتی ایجاد کنید، جنگو این امکان را به شما می دهد تا تیم جدید را پیدا کنید تا معماری پروژه شما را با تلاش کمی درک کند که این موضوع می تواند باعث صرفه جویی در پول و هزینه ی شما تا حد زیادی شود."
                    "– یکی از مزیت های قابل توجه جنگو این است که حتی اگر پروژه از ابتدا تا انتها توسط یک تیم، توسعه پیدا کند، با استفاده از جنگو روند برنامه نویسی با سرعت قابل توجهی بالا می رود، از ایده تا انتشار تا راه اندازی و تولید، با استفاده از کدنویسی بسیار واضح  و تمیز، توسعه می تواند کارآمد و موثر باشد."
                    "– همه میدانیم که زمان = پول. به همین دلیل است که جنگو ” فریم ورکی برای افراد کمال گرا با مهلت های کاری محدود” محسوب می شود که همین موضوع اجازه می دهد تا هر توسعه دهنده به سرعت ساختار پروژه را درک کند و آنها به ابزارهایی نیاز دارند که هر ایده ای را پیاده سازی کنند و آن را به درستی توسعه دهند و درهمان زمان ضبط نمایند."),
                text_style(title: "زبان برنامه نویسی PHP چیست ؟"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/PHP-logo.svg-min-2048x1106.png",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "PHP یک زبان برنامه نویسی است که میتوانیم با استفاده از آن اقدام به ساخت صفحات وب داینامیک (Dynamic) کنیم. با استفاده از PHP میتوانیم سایت و اپلیکیشن های تحت وب قدرتمندی را برنامه نویسی کنیم."
                    "اگر بخواهیم ریزتر به سوال PHP چیست؟ پاسخ دهیم، باید بگوییم که PHP کارهای پشت صحنه را در صفحات وب انجام میدهد. به این معنا که شما با استفاده از PHP نمیتوانید ظاهر سایت را تغییر دهید. PHP یک زبان برنامه نویسی است که تاثیر مستقیمی روی ظاهر سایت ندارد. با استفاده از PHP شما میتوانید اطلاعات مختلف را از پایگاه داده بگیرید و به کاربر نشان دهید."),
                text_style(title: "داینامیک و استاتیک یعنی چی؟"),
                Text(
                    "در ادامه‌ی پاسخ به سوال PHP چیست؟ میخواهیم درباره‌ی دو موضوع صفحات وب داینامیک (Dynamic) و استاتیک (Static) صحبت کنیم و خیلی ساده آن‌ها را توضیح دهیم."
                    "فرض کنید که شما در سایت‌تان یک بخشی دارید که میخواهید آخرین اخبار شرکت خودتان را نمایش دهید. برای نمایش این اخبار، از ۲ روش میتوانید استفاده کنید:"
                    "روش اول: بصورت دستی وارد کدهای HTML سایت خودتان شوید و اخبار را در کدهای HTML بصورت دستی بنویسید."
                    "روش دوم: اخبار را ابتدا وارد پایگاه داده یا دیتابیس بکنید و سپس با استفاده از یک زبان برنامه نویسی مثل PHP، آن اخبار را از دیتابیس بخوانید و به کاربران نشان دهید."
                    "روش اول، یعنی زمانی که شما بصورت دستی اقدام به نوشتن اخبار در صفحات وب خود میکنید را روش Static میگویند و اصطلاحا میگویند که آن صفحه‌ی شما، یک صفحه‌ی وب استاتیک یا Static Web Page است."
                    "اما وقتی که شما اطلاعات و کلا محتویات صفحه را از یک پایگاه داده میخوانید و به کاربران نشان میدهید، آن صفحه‌ی وب شما به یک صفحه‌ی وب داینامیک یا Dynamic Web Page تبدیل میشود."),
                text_style(title: "فریمورک لاراول چیست ؟"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/VPFCsW8yTV3x0SmlRLtu8phgnxa607YetR6UmHPA-min.png",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "زبان برنامه نویسی PHP یکی از برترین و محبوب‌ترین زبان‌های برنامه ‌نویسی در حوزه طراحی وب است. این زبان برنامه نویسی Framework ‌های بسیار زیادی دارد که لاراول یکی از آن‌ها است."
                    "زمانی که در مورد فریم ورک‌های توسعه وب اپلیکیشن صحبت می‌شود، همیشه نام لاراول به میان می‌آید. از لاراول می‌توان به عنوان محبوب‌ترین فریم ورک زبان برنامه نویسی PHP یاد کرد. این فریم ورک توانسته است در زمانی کوتاه، به اولین گزینه‌ی توسعه دهندگان برای توسعه برنامه‌های پیچیده تحت وب تبدیل شود."
                    "لاراول فریم ورکی مبتنی بر معماری MVC است که به صورت رایگان و متن باز ارائه شده است. این فریم‌ ورک امکانات هوشمندی در اختیار برنامه نویسان قرار می‌دهد و برنامه‌‌ نویسی را برای آن‌ها لذت بخش‌تر می‌کند."
                    "این فریم ورک در بین سایر فریم ورک‌های PHP از امنیت و سرعت توسعه‌ی بیشتری برخوردار است و از طریق آن شما قادر خواهید بود بدون اینکه تغییری در کدهای اصلی ایجاد کنید، عملکرد بسیاری از بخش‌ها را تغییر دهید."
                    "سوالی که بسیاری از برنامه‌نویسان در خصوص فریم ورک laravel دارند این است که آیا فریمورک لاراول تاثیری بر سرعت انجام پروژه آنها دارد؟"
                    "لاراول دارای امکانات و ویژگی‌هایی است که قطعا بر سرعت انجام پروژه‌ها تاثیر می‌گذارد. با ما همراه باشید تا به بررسی برخی از این ویژگی‌ها بپردازیم:"
                    "Service Container: این امکان به عنوان ابزاری قدرتمند وابستگی بین کلاس‌ها را مدیریت می‌کند."
                    "Queues : تعریف صف در لاراول، به شما این امکان را می‌دهد تا در انجام اموری که زمان زیادی نیاز دارند وقفه ایجاد کنید و در خصوص زمان انجام آن، بعدا تصمیم‌گیری کنید. لاراول دارای یک API متمرکز، برای مدیریت صف است."
                    "Events: در لاراول، شما به راحتی می‌توانید بر هر اتفاقی که در اپلیکیشن شما رخ می‌دهد نظارت کنید و به سرعت ریشه خطاها را پیدا کنید."
                    "رابط کاربری : برجسته ترین ویژگی لاراول، رابط و محیط کاربری راحت آن است. این رابط کاربری به‌علاوه امکاناتی که در اختیار شما قرار می‌دهد، تاثیر بسزایی بر سهولت و سرعت انجام امور دارد.حال که با مفهوم تاثیر استفاده از فریم ورک laravel بر سرعت پروژه آشنا شدید در امتداد مقاله به بررسی مزیت استفاده از لارول می پردازیم."
                    "تمام ویژگی های گفته شده باعث افزایش سرعت پروژه با لاراول می شود."),
                text_style(title: "وردپرس چیست ؟"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/turquoise-logo-wordpress-cms-png-7-min.png",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "اگر بخواهیم به زبان ساده به معرفی وردپرس بپردازیم، وردپرس عبارت است از یک سیستم مدیریت محتوای سایت ساز که با استفاده از آن قادر خواهید بود تا به راه اندازی انواع گوناگونی از وبسایت و وبلاگ بپردازید. با اطمینان بر اساس تجربیات شخصی و نمونه های  مشاهده شده به جرأت می توانم این اطمینان را به شما بدهم به دلیل انعطاف بالایی که سیستم مدیریت محتوای وردپرس دارد با استفاده از آن قادر خواهید بود تا اقدام به راه اندازی هر نوع وبسایت با وردپرس کنید."
                    "وردپرس، یک سیستم سایت ساز و پکیج راه انداز وب‌سایت، فروشگاه اینترنتی و وبلاگ (از هر نوع و هر مدل است) است که به صورت رایگان شما می‌توانید آن را از طریق وب‌سایت رسمی وردپرس (فارسی یا انگلیسی) دانلود کرده و بر روی فضای اینترنتی خود نصب کنید. فضای اینترنتی همان فضایی است که سایت شما و محتویات آن بر روی آن فضا قرار می‌گیرد و سپس وب‌سایت خود را به طور کامل با جزئیات و امکانات متفاوت و طرح دلخواه بر روی آن راه اندازی کرده و مطالب و بخش‌های مختلف سایت را خودتان مدیریت کنید."),
                Container(
                  color: Colors.lightBlueAccent.shade100,
                  child: Column(
                    children: [
                      Image.network(
                          "https://nahalit.com/wp-content/uploads/2022/11/121-min.png"),
                      Text(
                          "جهت مشاهده ی تمامی قالب های آماده به فروش (وردپرس (WordPress) و HTML و CSS و قالب جنگو (DJango)) و ثبت سفارش ، می توانید از طریق لینک زیر اقدام کنید."),
                      TextButton(
                        onPressed: () {
                          Navigator.push(
                              context,
                              MaterialPageRoute(
                                  builder: (context) => Purchase_guide()));
                        },
                        child: Text(
                          "مشاهده انواع قالب ها و ثبت سفارش",
                          style: TextStyle(color: Colors.white),
                        ),
                        style: ButtonStyle(
                          backgroundColor:
                              MaterialStateProperty.all<Color>(Colors.green),
                        ),
                      ),
                    ],
                  ),
                )
              ],
            ),
          ),
        ),
      ),
    );
  }
}
