import 'package:flutter/material.dart';
import 'package:nahal_it/Screens/purchese_guide.dart';

class text_style extends StatelessWidget {
  final String title;

  const text_style({super.key, required this.title});

  @override
  Widget build(BuildContext context) {
    var size = MediaQuery.of(context).size;
    return Text(title, style: TextStyle(
        fontSize: size.width*0.05,
        fontWeight: FontWeight.bold,
        color: Colors.green.shade800
    ),
    );
  }

}


class Website_design extends StatelessWidget {

  @override
  Widget build(BuildContext context) {
    var size = MediaQuery.of(context).size;
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.green,
        centerTitle: true,
        title: Text("طراحی وبسایت اختصاصی"),
      ),
      body: Directionality(
        textDirection: TextDirection.rtl,
        child: SingleChildScrollView(
          child: Padding(
            padding: EdgeInsets.all(8),
            child: Column(
              children: [
                Image.network("https://nahalit.com/wp-content/uploads/2022/11/%D8%B7%D8%B1%D8%A7%D8%AD%DB%8C-%D8%B3%D8%A7%DB%8C%D8%AA-%D8%A7%D8%AE%D8%AA%D8%B5%D8%A7%D8%B5%DB%8C.jpg"),
                text_style(title: "طراحی انواع وب سایت اختصاصی"),

                Text("وب سایت و فروشگاه ایننرنتی شما نمایندگی کسب وکارتان در فضای دیجیتال است. امروزه بسیاری از مخاطبان پیش از تعامل مستقیم با شما نخستین بار با وب سایت شما مواجه شده و تلقی خود از کسب وکار تان را با کیفیت طراحی وب سایت شما می سنجند."
"باتوجه به اینکه دنیای کسب وکار‎ها به سمت دیجیتالی شدن رفته، همه صاحبان کسب و کار‎ها برای دیده شدن بین رقبا ناگزیر به آنلاین کردن کسب و کارشون هستن و قطعا یکی از گام های اساس برای آنلاین کردن کسب وکارمون، طراحی سایت هست."
                    "وب سایت نماینده شما در فضای دیجیتال است که بدون تعطیلی و در تمام روز های هفته می تواند به معرفی شما و یا فروش محصولات و خدمات شما بپردازد ."
"تجربه تیم ما در طراحی وب سایت و فروشگاه اینترنتی، برای برند های گوناگون در صنایع مختلف به ما کمک می کند تا بر اساس خواسته های هر کسب وکار، رقبای فعال، زمینه فعالیت و … بهترین تکنولوژی مورد نیاز طراحی وب سایت مد نظر شما را مشخص کرده و با طراحی تجربه کاربری و رابط کاربری مناسب وب سایت شما را طراحی نماییم."
"قطعا طراحی سایت لازمه ی کار هست اما برای اینکه شاهد نتیجه گرفتن ازش باشیم، باید به مخاطبانی که متقاضی دریافت محصولات یا خدمات ما هستن، اعلام کنیم که سایتمون رو ایجاد کردیم و  ازشون دعوت کنیم که از سایت ما بازدید کنن که این دعوت به بازدید از سایت در دنیای دیجیتال از راه های مختلفی مثل سئو و خدمات دیگه رقم میخوره که تو بخش خدمات وب سایت و سئو وب سایت کامل توضیح دادیم براتون."
"در ادامه ، با انواع وب سایت ها آشنا خواهید شد."

                ),

               text_style(title: "طراحی وب سایت فروشگاهی"),

                Text(
"با توجه به فراهم شدن بستر استفاده از پرداخت اینترنتی و از سوی دیگر مشکلاتی مانند ترافیک، ازدحام جمعیت و نداشتن وقت کافی برای خرید حضوری، این روزها تمایل افراد برای خرید کالا به صورت اینترنتی رو به افزایش است."                        "اما چرا یک وب سایت نیازمند یک قالب است؟ مگر نمی‌شود از قالب‌ های پیش‌فرض استفاده کرد؟ پاسخ قطعا خیر است! چرا که قالب‌ های پیش‌ فرض بسیار ابتدایی هستند و امکانات زیادی در اختیار شما نمی‌ گذارند."
"هر کسی دوست دارد بدون خروج از منزل یا محل کار، سریعا وارد سایت یک فروشگاه اینترنتی شده و محصول خود را خریداری کند. بنابراین توجه به مسئله ساخت سایت فروشگاهی برای کسب و کارهای سنتی، افزایش یافته است."
    "استفاده از خدمات طراحی سایت فروشگاهی حرفه ای این امکان را به شما خواهد داد که بتوانید بازار هدف خود را که شامل مشتریان یک محله و شهر خاصی هستند را توسعه داده و در سطح کلان کشوری آنها را جذب کنید. این کار باعث دیده شدن بیشتر خدمات و محصولات شما شده و خواهید توانست به راحتی بازار بزرگی از مشتریان را به خود جذب کنید."



                ),
                text_style(title: "طراحی وب سایت خبری"),
                Image.network("https://nahalit.com/wp-content/uploads/2022/11/987-1-min.png",
                  width: size.width*0.5,
                  height: size.width*0.5,),
                Text(
                   "افراد عاشق شنیدن خبر های تازه هستند . اما از آن جایی که بسیاری از مردم این روزها به دنیای اینترنت رو آورده اند، بسیاری از اخبار را از طریق وب سایت های خبری دنبال می کنند. به همین علت طراحی وبسایت خبری از تقاضای بالایی در تهران و دیگر شهرستان ها برخوردار شده است . وب سایت نهال آی تی به شما کمک می کند تا با آسودگی خاطر اقدام به سفارش طراحی وب سایت کنید."
"اگر با حوزه تولید محتوا آشنا باشید، می‌دانید که اگر تولید محتوای مناسب و جذابی داشته باشید، روزانه هزاران کاربر را به سمت خود می‌کشانید. همین ویژگی افزایش بازدید در طی ماه‌ها و سال‌ها موجب شده تا درآمد سایت‌های خبری تا حد زیادی افزایش یابد."

                ),
                text_style(title: "طراحی وب سایت شرکتی"),
                Image.network("https://nahalit.com/wp-content/uploads/2022/11/vouhc94qrfoj-min.png",
                  width: size.width*0.5,
                  height: size.width*0.5,),
                Text(
                  "اگر هدف شما از طراحی سایت شرکتی، ورود به عرصه رقابت با وب سایت ها و شرکت های رقیب که فعالیتی مشابه شما دارند است، حتما طراحی وب سایت شرکتی اختصاصی لازمه موفقیت کار شماست."
"در پروژه های طراحی سایت شرکت نهال آی تی ، علاوه بر زیبایی نمای بصری و گرافیکی وب سایت در طرح های اختصاصی، نیاز و سلیقه شما در دیزاین لحاظ شده و همچنین اصول اولیه افزایش رتبه وب سایت و سئو نیز بر اساس نوع فعالیت شما به نحو شایسته ای در سایت طراحی شده پیاده سازی می‌ شود."
"علاوه بر آن امکانات خاص مد نظر شما در طراحی سایت شرکت با انتخاب طراحی وب سایت اختصاصی قابلیت توسعه بیشتری خواهد داشت."

                ),
                text_style(title: "طراحی وب سایت اشتراک گذاری عکس و فیلم"),
                Image.network("https://nahalit.com/wp-content/uploads/2022/11/image3-4.png",
                  width: size.width*0.5,
                  height: size.width*0.5,),
                Text(
                    "پنل مدیریت وب سایت به اشتراک گذاری ویدئو و اشتراک گذاری عکس یکی از cms های دست نویس تیم نهال آی تی می باشد و از هیچ گونه سیستم های آماده همانند وردپرس و جوملا و … استفاده نشده است و به زبان php نوشته شده است."
                "با توجه به دست نویس بودن کامل این سیستم، امکان اختصاصی سازی چه از نظر ظاهری و چه از نظر امکانات و بخش ها قابل مدیریت و برنامه نویسی می باشد ."
                ),

                Image.network("https://nahalit.com/wp-content/uploads/2022/11/%D8%AA%D8%B9%D8%B1%D9%81%D9%87-%D8%B7%D8%B1%D8%A7%D8%AD%DB%8C-%D9%88%D8%A8%D8%B3%D8%A7%DB%8C%D8%AA-%D8%A7%D8%AE%D8%AA%D8%B5%D8%A7%D8%B5%DB%8C-%D8%A8%D8%A7-%D8%B2%D8%A8%D8%A7%D9%86-%D9%84%D8%A7%D8%B1%D8%A7%D9%88%D9%84-1098x2048.png"),
                Image.network("https://nahalit.com/wp-content/uploads/2022/11/%D8%AA%D8%B9%D8%B1%D9%81%D9%87-%D8%B7%D8%B1%D8%A7%D8%AD%DB%8C-%D9%88%D8%A8%D8%B3%D8%A7%DB%8C%D8%AA-%D8%A7%D8%AE%D8%AA%D8%B5%D8%A7%D8%B5%DB%8C-%D8%A8%D8%A7-%D8%B2%D8%A8%D8%A7%D9%86-%D8%AC%D9%86%DA%AF%D9%88-1098x2048.png"),
                Image.network("https://nahalit.com/wp-content/uploads/2022/11/%D8%AA%D8%B9%D8%B1%D9%81%D9%87-%D8%B7%D8%B1%D8%A7%D8%AD%DB%8C-%D9%88%D8%A8%D8%B3%D8%A7%DB%8C%D8%AA-%D8%A7%D8%AE%D8%AA%D8%B5%D8%A7%D8%B5%DB%8C-%D8%A8%D8%A7-%D8%B2%D8%A8%D8%A7%D9%86-php-1098x2048.png"),
                Image.network("https://nahalit.com/wp-content/uploads/2022/11/%D8%AA%D8%B9%D8%B1%D9%81%D9%87-%D8%B7%D8%B1%D8%A7%D8%AD%DB%8C-%D9%88%D8%A8%D8%B3%D8%A7%DB%8C%D8%AA-%D8%A7%D8%AE%D8%AA%D8%B5%D8%A7%D8%B5%DB%8C-%D8%A8%D8%A7-%D9%88%D8%B1%D8%AF%D9%BE%D8%B1%D8%B3-1098x2048.png"),

                Container(
                  color: Colors.lightBlueAccent.shade100,
                  child: Column(
                    children: [
                      Image.network("https://nahalit.com/wp-content/uploads/2022/11/121-min.png"),
                      Text("جهت سفارش انواع پروژه طراحی وب سایت ، میتوانید به صورت رایگان ، با شماره 09927674217 تماس بگیرید و یا از طریق لینک زیر اقدام کنید."),
                      TextButton(
                        onPressed: (){
                          Navigator.push(context, MaterialPageRoute(builder: (context)=> Purchase_guide()));
                        },
                        child: Text("سفارش پروژه طراحی انواع وب سایت",
                          style: TextStyle(
                              color: Colors.white
                          ),),
                        style: ButtonStyle(
                          backgroundColor:
                          MaterialStateProperty.all<Color>(Colors.green),
                        ),
                      ),
                    ],
                  ),
                )

              ],
            ),
          ),
        ),
      ),
    );
  }
}
