import 'package:flutter/material.dart';
import 'package:nahal_it/Screens/purchese_guide.dart';

class text_style extends StatelessWidget {
  final String title;

  const text_style({super.key, required this.title});

  @override
  Widget build(BuildContext context) {
    var size = MediaQuery.of(context).size;
    return Text(title, style: TextStyle(
        fontSize: size.width*0.05,
        fontWeight: FontWeight.bold,
        color: Colors.green.shade800
    ),
    );
  }

}


class Website_seo extends StatelessWidget {

  @override
  Widget build(BuildContext context) {
    var size = MediaQuery.of(context).size;
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.green,
        centerTitle: true,
        title: Text("خدمات وب سایت و سئو وب سایت"),
      ),
      body: Directionality(
        textDirection: TextDirection.rtl,
        child: SingleChildScrollView(
          child: Padding(
            padding: EdgeInsets.all(8),
            child: Column(
              children: [
                Image.network("https://nahalit.com/wp-content/uploads/2022/11/%D8%B3%D8%A6%D9%88-%D8%B3%D8%A7%DB%8C%D8%AA.jpg"),
                text_style(title: "خدمات وب سایت و سئو وب سایت"),

                Text("در این بخش از خدمات، سایت های آماده فروشگاهی و سازمانی و شرکتی و مدیریتی و اداری و خبری و اختصاصی، آماده به فروش می باشد که با زبان ها و فریم ورک های مختلف مانند جنگو و لاراول و وردپرس و php ارائه می شود."),

                text_style(title: "سئو وب سایت چیست ؟"),
                Image.network("https://nahalit.com/wp-content/uploads/2022/11/search-engine-optimization.png",
                  width: size.width*0.5,
                  height: size.width*0.5,),
                Text(
                  "سئو چیست؟ امروزه همان سوالی است که در تمامی زیرشاخه های کسب و کارهای اینترنتی و دیجیتال مارکتینگ، مطرح می شود."
                "به طور خلاصه می توان گفت بهینه سازی وب سایت یا همان سئو ، موجب می شود یک سایت توسط موتورهای جستجو نظیر گوگل، یعنی در صفحه سرچ آن ها به افرادی که کلمات مربوط به آن وب سایت ها را جستجو می کنند، در جایگاه بالاتری نمایش داده شود و آن افراد جذب وب سایت ها شوند."
           "تاریخچه سئو، به دهه ۹۰ میلادی و ظهور موتورهای جستجو برمی‌گردد."
"امروزه سئو یا بهینه سازی موتورهای جستجو به عنوان یک استراتژی بازاریابی موثر و صنعت رو به گسترش شناخته می‌شود. با همه گیری ویروس کرونا و افزایش تمایل مردم به انجام خرید اینترنتی اهمیت سرمایه گذاری روی سئو سایت بیشتر شد."
"اصطلاحاتی مثل سئو کردن سایت، بهبود سئو، افزایش سئو سایت و سئوسازی عباراتی هستند که کاربران فارسی زبان برای جستجو درباره سئو استفاده می‌کنند."
"با بهبود سئو سایت، جایگاه صفحات وب سایت و محتوای شما در نتایج موتورهای جستجو ساده ارتقاء پیدا می کند. هر چه وبسایت شما از نظر موتورهای جستجو بهتر باشد و از آن ها امتیاز بیشتری بگیرد، یعنی مطابق با فاکتور ها و معیارهای آن ها باشد، احتمال این که آن ها شما را در جستجوهای مربوطه برای کلمات کلیدی مرتبط با محصولات یا سرویس های شما توسط کاربران، ارائه کنند بیشتر می شود و جایگاه بالاتری نسبت به سایت هایی که مربوط به آن کلمات هستند ولی امتیاز کمتری دارند، کسب خواهید کرد."

                ),
                Text("موتور جست و جو چیست ؟",style: TextStyle(
                    fontSize: size.width*0.05,
                    fontWeight: FontWeight.bold,
                    color: Colors.green.shade800
                ),
                ),
                Image.network("https://nahalit.com/wp-content/uploads/2022/11/%D9%85%D9%88%D8%AA%D9%88%D8%B1-%D9%87%D8%A7%DB%8C-%D8%AC%D8%B3%D8%AA-%D9%88-%D8%AC%D9%88-1024x745-min.png",
                  width: size.width*0.5,
                  height: size.width*0.5,),

                Text(
                  "موتور جستجو یک ابزار آنلاین است که به افراد برای پیدا کردن اطلاعات مورد نظرشان در اینترنت کمک می‌کند. موتور جستجوی گوگل و موتور جستجوی بینگ مایکروسافت از معروف ترین موتورهای جستجو هستند."
                      "موتورهای جستجوی در نحوه رتبه بندی وب سایت‌ ها در هنگام جستجوی کلید واژه‌های مختلف توسط کاربران، عملکرد متفاوتی دارند. این تفاوت رتبه دهی ناشی از هوش مصنوعی مورد استفاده در موتورهای جستجو است."
"گوگل نتایج بهتری در هنگام جستجو به کاربران نشان ‌می‌ دهد و فرایند جستجو در اینترنت را برای کاربران در مقایسه با سایر موتورهای جستجو در گوگل دلپذیرتر است. به همین دلیل گوگل تبدیل به پرطرفدارترین موتور جستجو در اینترنت شده‌ است."

                ),
                text_style(title: "موتور جستجو چگونه کار می‌کند ؟"),

                Text(
                  "موتورهای جستجو مانند گوگل و بینگ برای بررسی صفحات مختلف در وبسایت‌ها از ربات‌ها استفاده می‌کنند. این ربات‌ها در واقع برنامه‌های کامپیوتری هستند که از سایتی به سایت دیگر می‌روند و اطلاعات مربوط به صفحات موجود در سایت‌های مختلف را جمع‌آوری می‌کنند. در نهایت این اطلاعات را در یک پایگاه داده عظیم ذخیره یا اصطلاحا ایندِکس (Index) می‌کنند."
"بطور کلی عملکرد موتورهای جستجو شامل چهار مرحله است:"
"1- خزش (Crawling) : مشاهده و بررسی صفحات وب سایت‌ ها که اصطلاحا به آن کراولینگ یا خزیدن می‌ گویند.\n"
"2- فهرست کردن (Indexing) : فهرست کردن صفحات مشاهده شده در پایگاه داده\n"
"3- رتبه بندی صفحات (Ranking) : رتبه‌بندی (رنکینگ) نتایج بر اساس کلمه کلیدی وارد شده توسط کاربر و فاکتورهای رتبه‌ دهی\n"
                      "4- نمایش نتایج به کاربر در صفحه نتایج جستجو\n"
                      "الگوریتم‌ های موتورهای جستجو برای نمایش صفحات معتبر و مرتبط در هنگام جستجوی یک کلیدواژه طراحی شده‌ اند تا تجربه‌ی گشت و گذاری کارآمد و دلچسب در فضای وب را در اختیار کاربرانشان قرار ‌دهند. سئو و بهینه سازی محتوای صفحات، می‌ تواند به شما در کسب رتبه‌ بالاتر در نتایج جستجو کمک کند."
                ),
                text_style(title: "رتبه بندی در SERP ها چیست ؟"),
                Image.network("https://nahalit.com/wp-content/uploads/2022/11/What-is-a-SERP-transformed-min-600x600.png",
                  width: size.width*0.5,
                  height: size.width*0.5,),
                Text(
                  "حالا که شما فهمیده اید که سئو چیست و چه معنا و مفهومی دارد، می خواهیم کمی جلوتر برویم. یکی دیگر از سوالات رایج که می شنویم این است :"
                   "رتبه بندی سایت در گوگل چیست؟"
"SERP (Search Engine Result Page) به معنی صفحه نتایج موتور جستجو می باشد. رتبه بندی سایت در گوگل شرکت شما یعنی جایگاه سایت شما در SERP گوگل."
"بهبود بهینه سازی سایت برای موتور جستجو به شما کمک می کند که رتبه بندی خودتان را تقویت کرده و میزان نمایش سایت خودتان به کاربران موتورهای جستجو افزایش دهید. هر چه رتبه بندی شما در SERP برای کلمات و عبارات کلیدی مربوطه بالاتر باشد، احتمالا مشتریان بیشتری سایت و خدمات و محصولات شما و یا موضوعات مربوطه در موتور جستجو را پیدا می کنند."
"برای بیشتر بخش ها، اکثر مشتریان فقط صفحه اول گوگل، بینگ یا هر موتور جستجوی دیگر را بررسی می کنند. به همین دلیل هر کسب و کاری که می خواهد قابلیت بازدید خودش را در موتور های جستجو و مشتریان خودش را افزایش دهد، باید تلاش کند که رتبه بندی SERP خودش را بهبود بخشد و در صفحه اول نتایج جستجو قرار بگیرد."

                ),
                text_style(title: "افزایش بازدید سایت"),
                Image.network("https://nahalit.com/wp-content/uploads/2022/11/seooo-transformed-min.png",
                  width: size.width*0.5,
                  height: size.width*0.5,),
                Text(
                  "افزایش بازدید سایت یکی از اصلی ترین کارهایی است که هر صاحب سایتی باید به آن اهمیت دهد. در واقع اگر شما صاحب هر کسب و کار آنلاینی هستید باید در صدد بالا بردن بازدید سایت خود باشید. فرقی نمی کند چه خدمات و محصولاتی را ارائه می کنید، در هر صورت باید به فکر بالا بردن بازدید سایت تان باشید. کاملا مشخص است که ترافیک هر سایتی جزئی از سرمایه آن است."
             "هر چقدر که وب سایت شما از هر لحاظی عالی باشد تا زمانی که نتوانید ترافیک واقعی دریافت کنید بی فایده است و هیچ سودی برای شما نخواهد داشت."
"دلیل عمده بسیاری از کسب و کارهای آنلاینی هم که موفق نیستند نداشتن ترافیک کافی است. همین حالا وب سایت هایی وجود دارند که از هر لحاظی با کیفیت هستند ولی مشکل اصلی آن ها دیده شدن است. در واقع مدیران این سایت ها در بالا بردن ترافیک سایت شان ناتوان هستند و نمی توانند به خوبی روزانه ترافیک واقعی و هدفمندی را روانه سایت خود کنند."
"در ضمن، این فقط کاربران اینترنتی نیستند که ترافیک سایت شما را افزایش می‌دهند؛ بلکه ربات‌ ها و ابزارهای آنلاین دیگری هم هستند که چنین بازدیدهایی رقم می‌ زنند. این تعریف بسیار ساده با ظاهر فریبنده‌ ای که دارد باعث شده تا اشتباهی بسیار رایج گریبان‌ گیر وب‌ مسترهای امروزی شود. اغلب این افراد حتی افراد باتجربه‌ تر، تمام تمرکز و انرژی خود را به منظور “کسب بازدید” می‌ گذارند. اما همانطور که ما بارها و بارها گفتیم، در بحث بازاریابی آنلاین، هیچ‌وقت کمیت بر کیفیت اولویت نخواهد داشت. این طرز فکری که اکثر وب‌ مسترها با آن درگیر هستند، فقط بحث جذب “بازدید” است نه “بازدیدکننده واقعی” و همین مسئله باعث می‌ شود تا تلاش‌ های مستمر این افراد آنطور که باید نتیجه نداشته باشد."
"با این توضیحات باید گفت که تمرکز اصلی شما نباید فقط روی تعداد بازدیدهای کسب شده باشد، بلکه باید روی مسئله نرخ تبدیل تمرکز کنید. مسلماً هرچه بازدیدهای کسب شده بیشتر باشد، شانس افزایش نرخ تبدیل نیز بیشتر می‌ شود."

               ),

                Image.network("https://nahalit.com/wp-content/uploads/2022/11/%D8%AA%D8%B9%D8%B1%D9%81%D9%87-%D8%AE%D8%AF%D9%85%D8%A7%D8%AA-%D8%B3%D8%A6%D9%88.png"),
                Image.network("https://nahalit.com/wp-content/uploads/2022/11/%D8%AA%D8%B9%D8%B1%D9%81%D9%87-%D8%AE%D8%AF%D9%85%D8%A7%D8%AA-%D8%B3%D8%A6%D9%88-%D8%AD%D8%B1%D9%81%D9%87-%D8%A7%DB%8C.png"),
                Image.network("https://nahalit.com/wp-content/uploads/2022/11/%D8%AA%D8%B9%D8%B1%D9%81%D9%87-%D8%A7%D9%BE%D9%84%DB%8C%DA%A9%DB%8C%D8%B4%D9%86-%D8%AE%D8%AF%D9%85%D8%A7%D8%AA-%D8%B3%D8%A6%D9%88-%D9%88%DB%8C%DA%98%D9%87.png"),


                Container(
                  color: Colors.lightBlueAccent.shade100,
                  child: Column(
                    children: [
                      Image.network("https://nahalit.com/wp-content/uploads/2022/11/121-min.png"),
                      Text("جهت سفارش انواع پروژه طراحی وب سایت و سئو، میتوانید به صورت رایگان ، با شماره 09927674217 تماس بگیرید و یا از طریق لینک زیر اقدام کنید."),
                      TextButton(
                        onPressed: (){
                          Navigator.push(context, MaterialPageRoute(builder: (context)=> Purchase_guide()));
                        },
                        child: Text("سفارش پروژه طراحی انواع وب سایت و سئو",
                          style: TextStyle(
                              color: Colors.white
                          ),
                        ),
                        style: ButtonStyle(
                          backgroundColor:
                          MaterialStateProperty.all<Color>(Colors.green),
                        ),
                      ),
                    ],
                  ),
                )

              ],
            ),
          ),
        ),
      ),
    );
  }
}
