import 'package:flutter/material.dart';
import 'package:nahal_it/Screens/purchese_guide.dart';

class text_style extends StatelessWidget {
  final String title;

  const text_style({super.key, required this.title});

  @override
  Widget build(BuildContext context) {
    var size = MediaQuery.of(context).size;
    return Text(
      title,
      style: TextStyle(
          fontSize: size.width * 0.05,
          fontWeight: FontWeight.bold,
          color: Colors.green.shade800),
    );
  }
}

class Website_templates extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    var size = MediaQuery.of(context).size;
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.green,
        centerTitle: true,
        title: Text("فروش قالب آماده سایت"),
      ),
      body: Directionality(
        textDirection: TextDirection.rtl,
        child: SingleChildScrollView(
          child: Padding(
            padding: EdgeInsets.all(8),
            child: Column(
              children: [
                Image.network(
                    "https://nahalit.com/wp-content/uploads/2022/11/%D8%B7%D8%B1%D8%A7%D8%AD%DB%8C-%D9%82%D8%A7%D9%84%D8%A8-%D8%B3%D8%A7%DB%8C%D8%AA1.jpg"),
                text_style(title: "فروش قالب سایت"),
                Text(
                    "در این بخش، قالب های html ، css ، جاوا اسکریپت (Java Script) ، ری اکت (React) ، ویو جی اس (vue js) ، نود جی اس (node js) ، وردپرس و غیره و ماژول های وردپرس، به فروش می رسد."),
                Text(
                  "قالب سایت چیست ؟",
                  style: TextStyle(
                      fontSize: size.width * 0.05,
                      fontWeight: FontWeight.bold,
                      color: Colors.grey.shade800),
                ),
                Text(
                    "قالب سایت (به انگلیسی: Site Template یا Site Theme) را می‌ توان مشابه دکور و قفسه‌بندی فروشگاه‌ ها در دنیای واقعی دانست. قالب سایت ترکیبی از رنگ، تصاویر و المان‌ های موجود در ‌سایت مانند دکمه‌ ها است و باعث می‌ شود فروشگاه شما مرتب و منحصر به فرد دیده شود. طراحی رابط‌ کاربری یا قالب اندازه نوشته‌ ها، عرض کلی صفحات و اندازه هر یک از ستون‌ های سایت را تعیین می‌ کند."
                    "اما چرا یک وب سایت نیازمند یک قالب است؟ مگر نمی‌شود از قالب‌ های پیش‌فرض استفاده کرد؟ پاسخ قطعا خیر است! چرا که قالب‌ های پیش‌ فرض بسیار ابتدایی هستند و امکانات زیادی در اختیار شما نمی‌ گذارند."
                    "پس برای حفظ کاربران وب سایت خود و جذب بازدیدکنندگان دیگر برای ارائه خدمات، فروش محصولات و… ، باید قالبی با ظاهری جذاب و مناسب تهیه کنید. این کار به شما کمک می‌کند تا کاربری که وارد سایت شما شده است را از سردرگمی ناشی از بهم ریختگی‌ نجات دهید. همچنین به دلیل طیف گسترده‌ ای از افراد که از سایت شما بازدید می‌ کنند و سلایق و علایق گوناگونی دارند، انتخاب قالبی که همه‌ ی آن‌ ها را راضی نگه دارد نیاز به هوش و ذکاوت خاصی خواهد داشت."
                    "در این بخش از سایت نهال آی تی ، قالب های html ، css ، جاوا اسکریپت (Java Script) ، ری اکت (React) ، ویو جی اس (vue js) ، نود جی اس (node js) ، وردپرس و غیره و ماژول های وردپرس، به فروش می رسد که در ادامه به بررسی و توضیح هر یک از اینها خواهیم پرداخت."),
                text_style(title: "قالب های وب HTML و CSS چیست؟"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/swlmhhhghszz-min.png",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "HTML یک زبان نشانه گذاری و اسکلت اصلی تمامی سایت هایی است که در سراسر دنیا به وجود می آیند است. HTML یک زبان بسیار ساده است و پیشنیاز ورود به دنیای طراحی وب می باشد."
                    "HTML یک زبان برنامه نوسی نیست و در اصل تنها برای نمایش محتوا در ساختار های از پیش تایین شده ساخته شده است."
                    "زبان HTML هیچ ظاهری ندارد و به کمک مکمل خود یعنی CSS ظاهر و شکل و شمایل می گیرد."
                    "هم HTML و هم CSS ساده ترین زبان های کامپیوتری و نشانه گذاری هستند."
                    "اگر شما هم طراح وب باشید و به این مقوله علاقه داشته باشید و فعالیت در این زمینه و یادگیری بیشتر یکی از اهداف شما باشد، از جمله بدیهی ترین اطلاعاتی که لازم است به آن تسلط پیدا کنید؛ مفاهیم مرتبط با اچ تی ام ال (HTML) و سی اس اس (CSS) می باشد."
                    "به عبارتی دانش بنیادی ای که هر شخص طراح آموخته و در کار خود به کار گرفته است، همین زبان نشانه گذاری متن می باشد که از طریق آن می توانید کدهایی را ایجاد کنید که هر یک منجر به نمایش یک سری از ویژگی ها در صفحات وب خواهند شد."
                    "دنیای طراحی وب دنیایی است شلوغ و پر رقابت ، بنابراین اگر واقعا قصد دارید به جایی برسید؛ باید تلاش کنید و بیشتر بیاموزید و نمونه کارهای بیشتری را طراحی نمایید."
                    "امروزه، با توجه به تغییراتی که در سبک بازاریابی و تبلیغات حاصل شده است ؛ طراحی سایت به عنوان یک مهارت جهانی در نظر گرفته می شود."
                    "شما در هر کشوری از دنیا که زندگی کنید با تسلط بر web design می تواند درآمد زایی داشته باشید اما کسی موفق است که اصولی و حرفه ای می آموزد و در نهایت حرفه ای نیز کار می کند."
                    "Html و css از مهمترین استانداردهای تصویب شده وب می باشند و برای ورود به این شغل، لازم است تا با مفاهیم مرتبط با آن ها آشنا شوید."),
                text_style(title: "زبان برنامه نویسی جاوا اسکریپت چیست ؟"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/jawa-askrypt-chyst-transformed-min.png",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "JavaScript که به اختصار JS نیز نامیده می‌ شود، یکی از محبوب ترین زبان‌ های برنامه نویسی است. جاوا اسکریپت زبانی سطح بالا، داینامیک، شی‌گرا و تفسیری است که از شیوه‌ های مختلف برنامه نویسی پشتیبانی می‌ کند."
                    "از این زبان می‌ توان برای برنامه نویسی سمت سرور (Server Side)، اپلیکیشن‌ های موبایل، بازی و اپلیکیشن‌ های دسکتاپ استفاده کرد. بنابراین می‌ توان اینگونه برداشت کرد که زبان برنامه نویسی جاوا اسکریپت ، یک زبان همه فن حریف است."),
                text_style(title: "کاربرد های جاوا اسکریپت"),
                Text(
                    "در چشم انداز مدرن امروزی، به لطف معرفی Node.js، جاوا اسکریپت برای همه چیز حتی برای فروشگاه سازها نیز استفاده می‌ شود. صرف نظر از اینکه چگونه از آن استفاده می‌ کنید، این فناوری نرم افزار قوی را برای شرکت‌ های سراسر جهان ایجاد می‌ کند."
                    "علاوه بر این، شرکت‌هایی مانند LinkedIn و Medium از آن برای ایجاد پلتفرم‌ هایی برای دسترسی کاربران به خدمات خود استفاده می‌ کنند."
                    "جاوا اسکریپت می‌ تواند انواع مختلفی از نرم افزارها مانند بازی‌ ها، برنامه‌ های کامپیوتری، برنامه‌ های کاربردی وب و حتی فناوری‌ هایی مانند بلاک چین را ایجاد کند."
                    "با این حال، جاوا اسکریپت مسلماً محبوب ترین زبان برنامه نویسی برای وب است. به عنوان مثال، بیش از 125000 شغل در لینکدین به دنبال افراد حرفه ای و ماهر در جاوا اسکریپت هستند."
                    "محبوب ترین کاربرد جاوا اسکریپت برای توسعه وب است و یکی از قدرتمندترین ابزارهایی است که یک توسعه دهنده می‌ تواند در لیست ابزار خود داشته باشد."
                    "توسعه‌دهندگان از جاوا اسکریپت در توسعه وب استفاده می‌ کنند تا تعامل و ویژگی‌ هایی را برای بهبود تجربه کاربر و لذت‌ بخش‌ تر کردن اینترنت اضافه کنند."
                    "جاوا اسکریپت فراتر از توسعه front-end گسترش یافته است، یعنی جایی که شروع شد. اخیراً، جاوا اسکریپت به انتهای توسعه وب گسترش یافته است و می‌ تواند در تمام پشته استفاده شود. این بدان معناست که توسعه‌ دهندگان به روش‌های CRUD (ایجاد، خواندن، به‌روزرسانی، تخریب) دسترسی دارند و اکنون حتی می‌ توانند در انتهای یک وب‌ سایت از آن‌ ها استفاده کنند."
                    "علاوه بر این، بر اساس W3techs، بیش از ۹۰٪ از تمام وب سایت‌ ها از جاوا اسکریپت استفاده می‌ کنند. این باعث می‌ شود که برجسته ترین رهبر در فناوری توسعه وب باشد."),
                text_style(title: "ری اکت (React) چیست ؟"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/React-JS-1-transformed-min.png",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "ری اکت یکی از کتابخانه های اوپن سورس (متن باز) جاوا اسکریپت هست که برای ساخت رابط های کاربری وب سایت ها مورد استفاده قرار می گیرد."
                    "کتابخانه ری اکت توسط جامعه ای از توسعه دهندگان فیس بوک ارائه شد. ریکت ابتدا در سال 2011 با هدف استفاده توسط خود فیسبوک ایجاد شد اما بعد ها با توسعه بیشتر و تکمیل شدنش در سال 2013 به یک کتابخانه عمومی برای استفاده همه برنامه نویس ها تبدیل شد."
                    "کتابخانه ری اکت جی اس به برنامه نویسان و توسعه دهندگان این امکان را خواهد داد تا با استفاده از انواع مختلف واسط های کاربری اپلیکیشن های مناسبی را با کامپوننت ها ایجاد نمایند و در این زمینه کمک بسیار شایانی را به برنامه نویسان ارائه می نماید. در حالت کلی کامپوننت از جاوا اسکریپت و html تشکیل می شود و منطقی که در کامپیوتر وجود دارد این موضوع می باشد که قسمت کوچکی از یک واسط کاربری بزرگتر خود را به نمایش بگذارد."),
                text_style(title: "تفاوت ری اکت با فریم ورک های دیگر"),
                Text(
                    "در اوایل قرن بیست و یکم در سال ۲۰۱۱ تعدادی از برنامه نویسان و توسعه دهندگان بسیار برجسته در دنیای وب یک مخزن بسیار پیشرفته به نام ToDoMVC راه اندازی کرده و در آن مخزن با سرعت فریم ورک و کتابخانه های محبوب موجود در سراسر دنیا یک اپلیکیشن را با فهرست کار یک ساعت پیاده سازی کردند."
                    "همچنین در اواخر سال ۲۰۱۲ بود که این پروژه به یک مکان غیررسمی برای مقایسه ابزارهای مختلف تبدیل شد."),
                text_style(title: "ویو جی اس چیست ؟"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/ndsmpb4j2hvj-transformed-min.png",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "vue.js یا ویو جی اس یک فریمورک برای زبان برنامه نویسی جاوا اسکریپت است و با استفاده از این فریمورک شما میتوانید فرانت اند یک وب سایت را هرچه سریعتر و زیباتر و کاراتر بسازید ."
                    "با وجود فریمورک Vue.js شما میتوانید از فریمورک ها یا کتابخانه های دیگر جاوا اسکریپت هم بهره بگیرید ولی vue.js تقریبا یک فریمورک کامل سمت کلاینت یا فرانت اند وب سایت است ."),
                text_style(
                    title: "فریمورک Vue.js ، بطور دیوانه کننده ای سریع است"),
                Text(
                    "قبول میکنم که اکثر فریمورک های جاوا اسکریپتی سریع هستند اما فریمورک Vue.js پرفرمنس و سرعت بسیار بالاتری دارد ."
                    "دلیل سرعت بالای Vue.js همانند React ، اتکا به virtual DOM است . همچنین Vue.js بسیار سبک است و به همین دلیل سرعت لود بالایی دارد ."
                    "همچنین تمامی وابستگی های این فریمورک در زمان رندر شدن بررسی می شود و سیستم میداند که کدام کامپوننت باید مجددا رندر شود یا اینکه بدون تغییر باقی بماند ."
                    "این نکته را هم در نظر داشته باشید که Vue.js بدون وابستگی به تمپلیت خاصی با html و css خالی و خام کار میکند و همچنین شما میتوانید روی هر فریمورک سی اس اس یا تمپلیت دیگر نیز از آن استفاده کنید ."
                    "وقتی شما با یک زبان برنامه نویسی یا یک فریمورک یا هر چیز دیگری که در این دسته ها قرار بگیرد کار میکنید جامعه ی اطراف آن است که تجربه های شما را می سازد ."
                    "این مهم است که پشتیبانی از چیزی که با آن کار میکنید توسط افراد زیادی باشد . این مهم است که منابع زیادی برای آن وجود داشته باشد ."
                    "اگر تعداد اعضای جامعه ی یک زبان یا فریمورک زیاد باشد به راحتی میتوانید مشاوره ی رایگان برای خود پیدا کنید یا میتوانید یک فرد پیدا کنید که پاسخ سوالات فنی شما را بدهد ."
                    "این مسئله زمانی بیشتر کاربرد دارد که شما روی پروژه عملی واقعی یا در شرکت واقعی مشغول به کار هستید و به مشکلی خاص برمیخورید که پاسخ ان در اینترنت هم نیست اینجاست که جامعه به کمک شما می آید ."
                    "فریمورک Vue.js از ابتدا در گیتهابش رو به گسترش بوده است ، انجمن بسیار فعالی دارد ، کنفرانس های بین المللی نیز دارد و همچنین منابع آموزشی خوب فارسی هم دارد ."),
                text_style(title: "نود جی اس (Node.js) چیست ؟"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/z5haaa5lwdko-min.png",
                  width: size.width * 0.5,
                  height: size.width * 0.5,
                ),
                Text(
                    "Node.js یک پلتفرم ایجاد شده بر پایه موتور جاوا اسکریپت گوگل کروم است که باعث سهولت ایجاد و مقیاس‌ پذیری برنامه‌ های تحت شبکه می‌ شود. این پلتفرم از یک مدل I/O رویداد محور استفاده می‌ کند که مسدود نشونده (non-blocking) است و همین امر باعث کاهش فشار موجود بر روی سرور و افزایش کارآیی می‌ شود و این امر برای اجرای برنامه‌ های مبتنی بر داده که بصورت بلادرنگ (Real-Time) بر روی سرورهای نامتمرکز استفاده می‌ شوند بسیار مناسب است."
                    "همانطور که می دانید جاوا اسکریپ یکی از برترین و محبوب ترین زبان های برنامه نویسی می باشد که در سرتاسر جهان مورد استفاده قرار می گیرد."
                    "Node.js درواقع پلتفرمی است که سمت سرور کار می کند و بر پایه جاوا اسکریپ بنیان گذاری شده است."
                    "اگر تاریخچه جاوا اسکریپت را مطالعه کرده باشید حتما نام آقای Ryan Dahl به گوشتان خورده است ، در واقع این آقا برای اینکه قدرتمندی جاوا اسکریپ را به رخ سایر زبان های برنامه نویسی بکشاند ، Node.js را معرفی کرد تا به همگان ثابت کند که این زبان برنامه نویسی نباید فقط برای بخش Front-end صفحات وب مورد استفاده قرار گیرد."
                    "در حقیقت Node js بود که به زبان جاوا اسکریپت این قدرت را داد که بتواند کد های خود را در محیط سرور اجرا کند و تا قبل از آن تمامی کد ها داخل مرورگر اجرا می شد. به کمک Node.js شما می توانید برنامه های گسترده و قابل گسترش بسازید که هیچ محدودیتی ندارند!"),
                Image.network(
                  "https://nahalit.com/wp-content/uploads/2022/11/%D8%AA%D8%B9%D8%B1%D9%81%D9%87-%D9%81%D8%B1%D9%88%D8%B4-%D9%82%D8%A7%D9%84%D8%A8-html-1152x1536.jpg",
                ),
                Container(
                  color: Colors.lightBlueAccent.shade100,
                  child: Column(
                    children: [
                      Image.network(
                          "https://nahalit.com/wp-content/uploads/2022/11/121-min.png"),
                      Text(
                          "جهت سفارش انواع پروژه طراحی وب سایت ، میتوانید به صورت رایگان ، با شماره 09927674217 تماس بگیرید و یا از طریق لینک زیر اقدام کنید."),
                      TextButton(
                        onPressed: () {
                          Navigator.push(
                              context,
                              MaterialPageRoute(
                                  builder: (context) => Purchase_guide()));
                        },
                        child: Text(
                          "سفارش پروژه طراحی انواع وب سایت",
                          style: TextStyle(color: Colors.white),
                        ),
                        style: ButtonStyle(
                          backgroundColor:
                              MaterialStateProperty.all<Color>(Colors.green),
                        ),
                      ),
                    ],
                  ),
                )
              ],
            ),
          ),
        ),
      ),
    );
  }
}
